{"text": "I am Akash, a 28-year-old male residing in Pune, Maharashtra. I work in an IT company and my job involves long hours in front of a computer, which sometimes adds stress but nothing unusual for my profession. Recently, I started feeling unwell; it began with a mild fever three days ago. At first, I thought it was just fatigue, but the fever hasn't subsided. Although the intensity of the fever is moderate, it has made me feel more tired than usual. I don't have a sore throat or cough, which makes me think it's just a passing fever. I live alone in a one-bedroom apartment, and I make sure to keep my living environment clean. I have been sticking to my usual vegetarian diet which includes dal, rice, and vegetables. I'm usually careful about staying hydrated and have access to clean drinking water. I lead a fairly active lifestyle, going for regular walks in the nearby park, but I haven't been able to keep up with it since this fever started. My sleep patterns are generally consistent, but this fever has been making me feel restless at night. I don't smoke or drink alcohol, and I haven't had any major surgery or hospitalisation in the past. I'm fully vaccinated as per the Indian immunisation schedule and have no known allergies. As far as I know, there is no significant family history of illness. Overall, I think it's a minor issue, but I thought it best to check in just to be sure.", "extracted": {"age": 28, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Pune, Maharashtra", "region": null, "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up-to-date", "allergies": null, "family_history": null, "diet": "vegetarian", "physical_activity": "regular walks", "sleep_pattern": "consistent but restless due to fever", "alcohol": "no", "tobacco": "no", "mental_health": null, "work_stress": "sometimes", "environmental_exposure": null, "housing": "one-bedroom apartment", "clean_water": "yes", "occupation": "IT professional", "symptom_duration_map": {"fever": "3 days"}, "symptom_intensity_map": {"fever": "moderate"}}, "label_leaf_id": "fever", "risk": 0.2, "uid": "799275aa"}
{"text": "Hello, my name is Ananya Sharma, and I am a 28-year-old woman from Pune, Maharashtra. I live in a modest apartment with my husband and work as a software developer in a multinational company. Recently, I've been experiencing a mild fever for the past three days. It started off as just feeling a bit warmer than usual, with temperatures ranging from 100°F to 101°F. I haven't felt unusually cold or experienced chills, but I've had a slight headache accompanying the fever. It's a bit uncomfortable but hasn't stopped me from working, albeit from home. I have a healthy lifestyle overall; I practice yoga regularly and eat mostly vegetarian food with a generous amount of fruits and vegetables. I don't consume alcohol or use tobacco. I make sure to get at least seven hours of sleep each night. My previous health record is quite clean, with no major illnesses or surgeries in the past. My family history is also generally healthy, with no notable hereditary diseases. We drink filtered water, and I'm confident about the sanitation conditions at home. Despite the mild discomfort, I'm not experiencing any cough, sore throat, or other such symptoms that might remind me of a cold or a flu. My immunizations are up to date, as per the schedule. As of now, I'm managing the fever with paracetamol, which I take once or twice a day as needed. I tend to keep my stress in check, though work deadlines can sometimes be draining. I don't perceive my current environment to have any major pollution issues, and living in Pune offers a fairly balanced urban lifestyle. Overall, I just want to make sure this fever doesn't develop into something more serious.", "extracted": {"age": 28, "sex": "female", "ethnicity": null, "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": ["paracetamol"], "immunisation_status": "up to date", "allergies": null, "family_history": "healthy", "diet": "mostly vegetarian", "physical_activity": "regular yoga", "sleep_pattern": "7 hours per night", "alcohol": false, "tobacco": false, "mental_health": null, "work_stress": "manageable", "environmental_exposure": "minimal", "housing": "modest apartment", "clean_water": true, "occupation": "software developer", "symptom_duration_map": {"fever": "3 days"}, "symptom_intensity_map": {"fever": "mild"}}, "label_leaf_id": "fever", "risk": 0.2, "uid": "ae3545e0"}
{"text": "Hi, I'm Rajesh, a 28-year-old man living in Mumbai. I've been experiencing a mild fever for the past two days. It's not very high, just around 100°F, but it's making me feel a bit weak. I work as a software engineer, and due to my job demands, I spend a lot of time in front of the computer which tends to strain my eyes. However, this fever has not been accompanied by any significant symptoms like a cough or sore throat. I've been taking paracetamol to manage the fever, and it seems to help temporarily. My diet is generally varied and includes a lot of vegetables and grains, combined with some dairy and meat. I make sure to exercise at least three times a week, mostly jogging around the local park. My sleep pattern is usually stable, getting around seven hours each night, but the fever has been disrupting my sleep slightly. I don't smoke or drink alcohol. Fortunately, I have never had any chronic illnesses, and my past medical history is quite unremarkable. I live in an apartment with clean facilities and access to clean drinking water. My mental health has been fine, and I don't face much work stress. I come from a middle-class family, and financially, we manage to support all our necessities. Growing up, I was vaccinated according to schedule, and I've not had any surgeries or prolonged hospitalizations. My family history is mostly clear, with no significant hereditary diseases that I'm aware of. Given that this fever is mild, I'm hoping it will pass soon without complications.", "extracted": {"age": 28, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle-class", "location": "Mumbai", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "paracetamol", "immunisation_status": "up to date", "allergies": null, "family_history": null, "diet": "includes vegetables, grains, dairy, and meat", "physical_activity": "jogs 3 times a week", "sleep_pattern": "usually stable, slightly disrupted", "alcohol": "none", "tobacco": "none", "mental_health": "fine", "work_stress": "minimal", "environmental_exposure": null, "housing": "apartment with clean facilities", "clean_water": "yes", "occupation": "software engineer", "symptom_duration_map": {"fever": "2 days"}, "symptom_intensity_map": {"fever": "mild"}}, "label_leaf_id": "fever", "risk": 0.2, "uid": "97b8a1aa"}
{"text": "Hello, I am Rajesh from the bustling city of Pune, and I'm reaching out because I've been feeling a bit under the weather lately. Over the past couple of days, I've been experiencing a mild fever, which started just two days ago. The fever hasn't been too intense, but it's enough to make me feel achy and a bit weak. It's the kind of fever where you just want to stay under a blanket and rest. I haven't noticed any other major symptoms, like a cough or sore throat, which is somewhat of a relief. I have a basic diet with a mix of home-cooked Indian meals, and I try to stay hydrated. I don't have any significant past medical conditions, surgeries, or chronic illnesses. No recent hospitalizations, and I'm up to date with all my immunizations. I'm 35 years old, a male, of Indian ethnicity. My household includes my wife and two children, and we all live in a decent apartment where the water supply is clean. I work as a software engineer, and my job can be stressful at times, but I try to manage it with regular yoga sessions. I don't smoke or use tobacco, and I only drink alcohol occasionally during family gatherings. Regarding my sleep pattern, I usually get around 7-8 hours of rest, though it has been slightly disturbed due to this fever. I have no known allergies or family history of severe illnesses. Given the symptoms and my general health background, I suspect it's something mild and probably viral, but I’d like some advice on managing it better.", "extracted": {"age": 35, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": null, "location": "Pune", "region": null, "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up to date", "allergies": null, "family_history": null, "diet": "mix of home-cooked Indian meals", "physical_activity": "regular yoga sessions", "sleep_pattern": "7-8 hours, slightly disturbed", "alcohol": "occasional", "tobacco": "none", "mental_health": null, "work_stress": "manageable", "environmental_exposure": null, "housing": "decent apartment", "clean_water": true, "occupation": "software engineer", "symptom_duration_map": {"fever": "2 days"}, "symptom_intensity_map": {"fever": "mild"}}, "label_leaf_id": "fever", "risk": 0.2, "uid": "8ed0365e"}
{"text": "I am Rajesh Mittal, a 36-year-old software engineer living in Bangalore, Karnataka. For the past five days, I have been experiencing a fever accompanied by a persistent cough. It all started quite suddenly, and I feel somewhat fatigued. The cough is dry and tends to worsen at night, disrupting my sleep. The temperature fluctuates and tends to spike in the afternoons. I've tried taking over-the-counter paracetamol to manage the fever, but the relief is temporary. There are no significant traces of phlegm, which is slightly reassuring. Historically, I don't have frequent illnesses apart from the occasional cold. I can't recall any respiratory problems in the past either. I did have dengue two years ago, and it was a challenging time since it required hospitalization. However, there haven't been any recent surgeries or hospital stays. I'm not allergic to anything, at least that I'm aware of. In my family, some have high blood pressure, but there's no history of chronic respiratory illnesses. Since I relocated to Bangalore from a small town in Rajasthan for work, my lifestyle has become more sedentary. I try to exercise twice a week and maintain a fairly balanced diet, with a preference for home-cooked vegetarian meals. I drink alcohol socially, maybe once a month, and I do not smoke. I sleep around six hours a night, though the cough has made it difficult recently. Additionally, my job can sometimes be stressful due to its demanding nature, but I usually manage it well. My housing is in a clean area of the city with access to clean water, which I ensure is always boiled before consumption. Given the pollution here is moderately high, I do take precautions while commuting to work on my motorbike, like wearing a pollution mask.", "extracted": {"age": 36, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Bangalore", "region": "Karnataka", "past_conditions": "dengue", "surgeries": null, "hospitalisations": "dengue", "chronic_illnesses": null, "medication_history": "paracetamol", "immunisation_status": null, "allergies": null, "family_history": "high blood pressure", "diet": "vegetarian", "physical_activity": "sedentary with exercise twice a week", "sleep_pattern": "disrupted, six hours a night", "alcohol": "socially, once a month", "tobacco": "none", "mental_health": null, "work_stress": "moderate", "environmental_exposure": "moderate pollution", "housing": "clean area of the city", "clean_water": "boiled", "occupation": "software engineer", "symptom_duration_map": {"fever": "5 days", "cough": "5 days"}, "symptom_intensity_map": {"fever": "moderate", "cough": "moderate"}}, "label_leaf_id": "fever_cough", "risk": 0.6, "uid": "82cd7834"}
{"text": "My name is Rahul, and I am a 32-year-old man living in Bengaluru, Karnataka. For the past three days, I've been experiencing a persistent fever accompanied by a mild but bothersome cough. The fever occasionally spikes in the evenings. I haven't had much of an appetite lately, probably due to feeling unwell, so I've been trying to stick to lighter meals, like rice and dal. I work as a software engineer, and while my job is primarily desk-based, I usually try to go for a short walk every evening to stay active. Recently, I've been too fatigued to maintain this routine. I do not smoke or use any tobacco products, and I only drink occasionally, maybe a beer on the weekends. My sleep has been quite disturbed due to the fever, as I find myself waking up from chills or coughing fits. In terms of my medical history, I generally consider myself healthy and have never been admitted to a hospital or undergone surgery. I'm not on any regular medication, and my vaccination history is up-to-date, including the recent COVID-19 vaccines. There are no known allergies within my family, and I don't have any chronic illnesses. My father has high blood pressure, but as far as I know, no other major health issues run in our family. My living situation is comfortable, with access to clean water and proper sanitation. I'm a bit concerned about whether I might have picked up something more serious, given the ongoing rise in viral infections. However, I still feel confident that this might just be a common viral infection that will pass soon without needing any drastic treatment.", "extracted": {"age": 32, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Bengaluru, Karnataka", "region": "South India", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up-to-date", "allergies": null, "family_history": "father has high blood pressure", "diet": "rice and dal", "physical_activity": "reduced short evening walks", "sleep_pattern": "disturbed due to fever and cough", "alcohol": "occasional, weekends", "tobacco": "none", "mental_health": null, "work_stress": null, "environmental_exposure": null, "housing": "comfortable", "clean_water": "access available", "occupation": "software engineer", "symptom_duration_map": {"fever": "3 days", "cough": "3 days"}, "symptom_intensity_map": {"fever": "mild to moderate", "cough": "mild"}}, "label_leaf_id": "fever_cough", "risk": 0.3, "uid": "b0322ad5"}
{"text": "Hi, I'm Ketan, a 32-year-old software engineer from Bangalore. Over the past few days, I've been experiencing a persistent cough and mild fever. It started just three days ago, with some slight throat irritation, but progressed to a dry cough and a fever of around 100.4°F. At first, I didn’t think much of it, attributing the symptoms to the changing weather or perhaps catching a cold from my colleague who was also unwell. However, despite taking over-the-counter paracetamol and cough syrup, the symptoms haven't subsided completely. I don't have any significant allergies or a history of chronic illnesses. I last visited a doctor for a routine check-up about six months ago. My family's health history is relatively clean, although my father does have hypertension. I'm generally healthy and have no history of hospitalisations or surgeries. I work out regularly and maintain a balanced vegetarian diet. Sleep isn’t a problem either; I manage to get around 7 to 8 hours each night, though the cough has disturbed my sleep in the past couple of nights. I don’t smoke or drink alcohol. Bangalore's weather has been quite fluctuating recently, which might be contributing to my condition. My work can be stressful at times, given the long hours, which sometimes affects my overall stress levels. I live in a modern apartment complex with good clean water and sanitation facilities. Though COVID-19 has been on my mind, I am fully vaccinated, and I make sure to follow safety protocols. Given the intensity of the cough and fever, I’m now a bit concerned.", "extracted": {"age": 32, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Bangalore", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "paracetamol, cough syrup", "immunisation_status": "fully vaccinated", "allergies": null, "family_history": "father with hypertension", "diet": "vegetarian", "physical_activity": "regular workout", "sleep_pattern": "7-8 hours, recently disturbed", "alcohol": null, "tobacco": null, "mental_health": null, "work_stress": "occasional", "environmental_exposure": "fluctuating weather in Bangalore", "housing": "modern apartment", "clean_water": true, "occupation": "software engineer", "symptom_duration_map": {"cough": "3 days", "fever": "3 days"}, "symptom_intensity_map": {"cough": "persistent", "fever": "mild"}}, "label_leaf_id": "fever_cough", "risk": 0.5, "uid": "ad31214e"}
{"text": "Hello, my name is Rajesh, and I've been experiencing a fever and persistent cough for the past few days. I'm 34 years old and live in Mumbai, Maharashtra, where I've been working in a marketing firm. The weather has been quite humid recently, which sometimes aggravates my respiratory issues. I recall last having a similar episode about a year ago during the monsoon season. I haven't been hospitalized or undergone any surgeries apart from the usual childhood ailments. My family doesn't have a history of respiratory problems, but my father was diabetic. In terms of medication, I usually manage with over-the-counter syrups for my cough and paracetamol for the fever. My diet generally consists of home-cooked meals like dals and vegetables, with an occasional chicken curry. I try to exercise by jogging in the local park, although my schedule lately has made it challenging. Sleep is usually restful, ranging from six to seven hours a night, though the coughing is starting to disrupt my rest. I don’t smoke or consume alcohol and haven’t been exposed to any known allergens recently. Most vaccinations are up-to-date, including the flu shot. The fever is moderate, with nighttime temperatures reaching 101°F, and the cough is dry and frequent, more intense at night. I think it's affecting my focus at work, but honestly, I feel it's manageable for now. Nonetheless, I would really like some advice or a prescription to help speed up my recovery.", "extracted": {"age": 34, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle_class", "location": "Mumbai", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": ["over-the-counter syrups", "paracetamol"], "immunisation_status": "up-to-date", "allergies": null, "family_history": "diabetes", "diet": ["dals", "vegetables", "chicken curry"], "physical_activity": "jogging", "sleep_pattern": "disrupted", "alcohol": "none", "tobacco": "none", "mental_health": null, "work_stress": "manageable", "environmental_exposure": "none", "housing": null, "clean_water": "available", "occupation": "marketing worker", "symptom_duration_map": {"fever": "few days", "cough": "few days"}, "symptom_intensity_map": {"fever": "moderate", "cough": "frequent"}}, "label_leaf_id": "fever_cough", "risk": 0.4, "uid": "3171b197"}
{"text": "Hi, I am Rajesh Kumar, a 45-year-old male residing in Pune, Maharashtra. I've been experiencing a persistent cough and fever for the past three weeks. Initially, I thought it was just a common cold, but the symptoms seem to be getting worse. The fever comes and goes, but when it's there, it's quite high, making me feel very weak and tired. The cough is dry and often keeps me awake at night, disrupting my sleep. I work as an accountant, which is quite stressful with long hours, and I think the stress might be worsening my condition. I've tried over-the-counter medications, but they haven't provided much relief. I live in an apartment in the city, and while the drinking water is usually clean, there are occasionally issues with contamination. I haven't been to the hospital for this condition yet, although I was hospitalized last year due to dengue fever. I was vaccinated for COVID-19 and I keep my immunizations up to date. There's no significant health issue history in my family. In terms of lifestyle, I am moderately active, trying to exercise three times a week. I avoid alcohol and tobacco completely. Although I maintain a mostly vegetarian diet typical in Maharashtra, I sometimes indulge in sweets, which I'm trying to cut down. I'm quite concerned about my condition, especially since I haven't felt this ill in a long time. Any advice or guidance would be greatly appreciated.", "extracted": {"age": 45, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Pune, Maharashtra", "region": "India", "past_conditions": "dengue fever", "surgeries": null, "hospitalisations": 1, "chronic_illnesses": null, "medication_history": "over-the-counter medications", "immunisation_status": "up to date", "allergies": null, "family_history": null, "diet": "mostly vegetarian", "physical_activity": "moderately active", "sleep_pattern": "disrupted due to cough", "alcohol": "none", "tobacco": "none", "mental_health": "stress-related", "work_stress": "high", "environmental_exposure": "occasional water contamination", "housing": "apartment in city", "clean_water": "usually clean", "occupation": "accountant", "symptom_duration_map": {"cough": "three weeks", "fever": "three weeks"}, "symptom_intensity_map": {"cough": "high", "fever": "high"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.85, "uid": "f6737c9e"}
{"text": "Hi, my name is Ravi and I'm a 45-year-old man living in Chennai, Tamil Nadu. For the past two weeks, I've been experiencing a persistent fever coupled with a severe cough that just doesn't seem to abate. Initially, I thought it was just a minor cold, but after persisting for this long, it's starting to worry me. The fever is quite high, often reaching up to 102°F, and the cough is dry but very intense, keeping me up at night. I haven't had much sleep because of this, and I feel extremely fatigued. I work as a software engineer and usually manage my tasks well, but lately, my productivity has plummeted due to this illness. I also started feeling slightly breathless, especially when I try to speak for extended periods or climb up the stairs. I've checked my oxygen saturation a few times, and it's mostly normal, but I'm still anxious because of the breathlessness. \n\nI haven't had any recent surgeries or hospitalizations. Regarding my medical history, I don't have any significant chronic illnesses, although I had a bout of pneumonia about five years ago, which was successfully treated. I'm a non-smoker and rarely drink alcohol. My diet is fairly balanced, typically consisting of rice, lentils, vegetables, and occasionally some chicken or fish. For vaccinations, I'm up-to-date, including the COVID-19 vaccine. We live in a reasonably clean environment with adequate clean water supply. My family history is mostly unremarkable, though my father had asthma. I've been considering visiting a doctor, but with the pandemic and work commitments, I kept putting it off. Now, however, I realize it's time to take this more seriously. Hopefully, with the right treatment, I'll be able to recover soon.", "extracted": {"age": 45, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Chennai", "region": "Tamil Nadu", "past_conditions": "pneumonia", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up-to-date, including COVID-19 vaccine", "allergies": null, "family_history": "father had asthma", "diet": "balanced diet with rice, lentils, vegetables, and occasionally chicken or fish", "physical_activity": null, "sleep_pattern": "disrupted due to cough", "alcohol": "rarely", "tobacco": "non-smoker", "mental_health": null, "work_stress": "increased due to illness", "environmental_exposure": null, "housing": null, "clean_water": "adequate", "occupation": "software engineer", "symptom_duration_map": "fever and severe cough for two weeks", "symptom_intensity_map": "high fever, severe cough, slight breathlessness"}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.85, "uid": "8cf8528f"}
{"text": "I am Rajesh, a 45-year-old man living in Pune, Maharashtra. I work as a software engineer in a multinational company. For the past two weeks, I have been experiencing persistent fever and a severe cough that seems to worsen at night. Initially, I thought it was just a common cold, but the symptoms have not improved and the fever remains quite high, reaching up to 102°F. Alongside the fever and cough, I have been feeling extremely fatigued and have lost my appetite. I have never had such severe symptoms before, and it is affecting my daily routine and my ability to focus on work. I have not had any major past illnesses except for occasional seasonal flu, which usually resolves in a few days. I had my appendix removed about ten years ago, but otherwise, I have not had any surgeries or major hospitalizations. I am generally healthy and do not have any chronic illnesses. I take vitamin supplements occasionally, but I am not on any regular medication. My immunisation status is up-to-date as I make sure to get my flu shot every year. I have no known allergies, and there is no significant family history of respiratory illnesses. My diet includes a mix of traditional Indian meals and occasionally some fast food. I exercise moderately, mostly through cycling over the weekends. My sleep pattern has been disturbed lately due to the symptoms, waking up multiple times at night. I do not drink alcohol or smoke tobacco. Despite the work stress, which is quite manageable, I have never had any major mental health issues. I live with my family in a comfortable apartment, and we have access to clean drinking water. Given the severity and duration of my symptoms, I am concerned and seek medical advice to understand what might be causing this prolonged and severe discomfort.", "extracted": {"age": 45, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": ["appendix removal"], "hospitalisations": null, "chronic_illnesses": null, "medication_history": "vitamin supplements", "immunisation_status": "up-to-date", "allergies": null, "family_history": null, "diet": "mix of traditional Indian meals and fast food", "physical_activity": "moderate, cycling on weekends", "sleep_pattern": "disturbed due to symptoms", "alcohol": "none", "tobacco": "none", "mental_health": null, "work_stress": "manageable", "environmental_exposure": null, "housing": "comfortable apartment", "clean_water": "yes", "occupation": "software engineer", "symptom_duration_map": {"fever": "2 weeks", "cough": "2 weeks", "fatigue": "2 weeks", "loss of appetite": "2 weeks"}, "symptom_intensity_map": {"fever": "severe", "cough": "severe", "fatigue": "severe", "loss of appetite": "moderate"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.9, "uid": "df7af821"}
{"text": "Hello, my name is Rajesh Kumar, and I'm a 45-year-old male residing in Bangalore, Karnataka. Over the past ten days, I've been experiencing a persistent fever accompanied by a severe cough. Initially, it started with mild symptoms, but as the days progressed, the fever intensified, and the cough became more frequent and disruptive. I've tried taking some over-the-counter medications such as paracetamol and cough syrup, but they don't seem to have much effect. I don’t have any known allergies, and my past medical history includes a bout of dengue fever about eight years ago and a minor surgery for a broken arm when I was a teenager. There's been no hospitalisation for these recent symptoms yet, but the duration and intensity are concerning. I work as a software engineer, which involves long hours at the desk. While my physical activity is limited to weekend cricket with friends, I ensure a balanced diet rich in vegetables, legumes, and rice. My sleep pattern has been disturbed lately due to the coughing, but I generally aim for about seven hours of sleep. Smoking and alcohol are not part of my lifestyle. My family history includes my father having diabetes, but there are no significant respiratory conditions. Given my current symptoms, there is a growing concern that this might be something beyond a common cold, and I believe I should seek further medical evaluation.", "extracted": {"age": 45, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Bangalore", "region": "Karnataka", "past_conditions": ["dengue fever"], "surgeries": ["minor surgery for a broken arm"], "hospitalisations": null, "chronic_illnesses": null, "medication_history": ["paracetamol", "cough syrup"], "immunisation_status": null, "allergies": null, "family_history": ["father has diabetes"], "diet": "balanced diet rich in vegetables, legumes, and rice", "physical_activity": "limited to weekend cricket", "sleep_pattern": "disturbed lately", "alcohol": "non-drinker", "tobacco": "non-smoker", "mental_health": null, "work_stress": "work involves long hours at the desk", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "software engineer", "symptom_duration_map": {"fever": "10 days", "cough": "10 days"}, "symptom_intensity_map": {"fever": "intensified", "cough": "severe"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.85, "uid": "eb515215"}
{"text": "Hi, my name is Rajesh, and I've been experiencing quite a bit of discomfort lately. Since last week, I've been dealing with an on-and-off headache. Typically, it feels like a heavy pressure around my temples, but it's not too severe. I'm 32 years old, and I live in Bengaluru, Karnataka. I suppose it's partially due to the stress of my occupation. I'm an IT professional, and my work involves long hours in front of a computer screen, which, I suspect, might be contributing to these headaches. In terms of lifestyle, my physical activity is rather limited. I tend to sit for extended periods and only manage to do light exercises on weekends. My diet is moderately healthy; I make an effort to have fruits and vegetables, though I do indulge in occasional fast food. My sleep schedule is somewhat irregular, usually around 6 hours a night, which could also be a factor at play. I don't consume alcohol often, maybe once a month, and I don't smoke. My environment at home is quite comfortable. I live in a decent neighborhood, and we have access to clean water. I haven't had any major past health issues or surgeries. In terms of family history, my father did have hypertension, but the rest of the family history is unremarkable. Honestly, the headaches haven't interfered too much with my daily activities, but they are bothering me enough to seek some advice. I haven't tried any medication for it yet, as I prefer to explore lifestyle changes first.", "extracted": {"age": 32, "sex": null, "ethnicity": null, "socioeconomic_status": null, "location": "Bengaluru, Karnataka", "region": null, "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": "Father with hypertension", "diet": "Moderately healthy, occasional fast food", "physical_activity": "Limited, light exercise on weekends", "sleep_pattern": "Irregular, usually 6 hours a night", "alcohol": "Occasional consumption, once a month", "tobacco": "Non-smoker", "mental_health": "Mild work stress", "work_stress": "High due to long hours in front of a screen", "environmental_exposure": null, "housing": "Comfortable housing", "clean_water": true, "occupation": "IT professional", "symptom_duration_map": {"headache": "1 week"}, "symptom_intensity_map": {"headache": "mild"}}, "label_leaf_id": "headache", "risk": 0.2, "uid": "49d68fdb"}
{"text": "Hello, I am Priya, a 28-year-old woman living in Bangalore, Karnataka. Over the past week, I've been experiencing a persistent headache. It started as a dull throb at the back of my head but evolved into something more intense in the middle of the week. Although I don't have a history of migraines or any similar conditions, I've found the discomfort to be quite bothersome, especially as I work long hours in an IT company, which requires a lot of screen time. I am generally healthy and have not had any surgeries or chronic illnesses. I stay active by practicing yoga and walking daily. My diet typically consists of home-cooked vegetarian meals, but I occasionally eat out with friends. I try to get about seven hours of sleep each night, but the headache has been interfering with my sleep recently. I don't smoke or drink alcohol often. My family has a history of high blood pressure, but I've never experienced any issues myself. I drink filtered water at home. My work can be stressful, especially with tight deadlines, and I wonder if this could be contributing to my headaches. I don't have any known allergies and have kept up with all my vaccinations. I'm concerned because the headache has persisted longer than usual and is starting to affect my daily routine.", "extracted": {"age": 28, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Bangalore", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up-to-date", "allergies": null, "family_history": "high blood pressure", "diet": "vegetarian", "physical_activity": "yoga and walking", "sleep_pattern": "about seven hours but disrupted by headache", "alcohol": "infrequent", "tobacco": "none", "mental_health": null, "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": "filtered", "occupation": "IT professional", "symptom_duration_map": {"headache": "1 week"}, "symptom_intensity_map": {"headache": "persistent but mild to moderate intensity"}}, "label_leaf_id": "headache", "risk": 0.3, "uid": "320ce60b"}
{"text": "I've been dealing with recurring headaches for a few years now, but lately, they've become more intense and debilitating. I'm a 32-year-old woman living in Bengaluru, working in the IT industry. Our work hours are quite demanding and often involve tight deadlines, which sometimes adds to my stress level. My headaches usually begin with a dull ache on one side of my head and gradually build into a throbbing pain that makes it challenging to focus on my tasks. When the migraines hit, they often make me feel nauseated and sensitive to light and sound. These episodes can last anywhere from a few hours to a couple of days. To cope, I try to rest in a dark, quiet room and avoid triggers like loud noises and bright lights. I don't have a regular exercise routine, but I do try to take a walk every evening. My diet mostly includes traditional Indian meals, like dal and rice, and I make sure to drink plenty of water. I rarely consume alcohol and do not smoke. My father also suffered from migraines, so I think it might run in the family. I haven't been hospitalized for this condition, but I have visited a neurologist who prescribed medications like sumatriptan, which helps to some extent. Lately, it feels like the intensity has been increasing, and I'm worried it might affect my work performance.", "extracted": {"age": 32, "sex": "female", "ethnicity": null, "socioeconomic_status": null, "location": "Bengaluru", "region": "Karnataka", "past_conditions": ["headaches"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": ["migraines"], "medication_history": ["sumatriptan"], "immunisation_status": null, "allergies": null, "family_history": ["migraines"], "diet": "traditional Indian meals, dal and rice", "physical_activity": "evening walks", "sleep_pattern": null, "alcohol": "rarely consume", "tobacco": "do not smoke", "mental_health": null, "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "IT professional", "symptom_duration_map": {"headache": "few years", "migraine": "few hours to a couple of days"}, "symptom_intensity_map": {"migraine": "increasing intensity"}}, "label_leaf_id": "headache_migraine", "risk": 0.6, "uid": "d65805a8"}
{"text": "Hello, my name is Anjali, and I am a 34-year-old woman living in Pune, India. I've been experiencing migraines for the past few years, but they've become more frequent and severe in the last six months. The headaches are usually on one side of my head, accompanied by nausea and sensitivity to light and sound. The pain can be so intense that it often interferes with my daily activities, making it difficult for me to focus on my work. I work as a software engineer, which involves long hours at a computer. I have noticed that my migraines tend to worsen after particularly stressful days or if I skip meals. My diet consists mostly of traditional Indian meals, and I try to eat healthily. I do not consume alcohol regularly and have never smoked. Exercise is not a regular part of my routine, and my lifestyle is quite sedentary due to my job demands. I haven't been diagnosed with any other chronic illnesses, but my mother also suffers from migraines. I do take over-the-counter pain relief medications, but they do not always help. I generally manage to sleep around six to seven hours per night, but the quality of my sleep could be better. As for my living situation, I live in a well-maintained apartment with access to clean water. Regarding my immunization, I am up-to-date with all the necessary vaccines. Overall, my migraines are becoming a significant concern, and they are affecting my productivity and quality of life.", "extracted": {"age": 34, "sex": "female", "ethnicity": null, "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": "migraines", "medication_history": "over-the-counter pain relief medications", "immunisation_status": "up-to-date", "allergies": null, "family_history": "mother suffers from migraines", "diet": "traditional Indian meals", "physical_activity": "sedentary lifestyle", "sleep_pattern": "six to seven hours per night, low quality", "alcohol": "do not consume regularly", "tobacco": "never smoked", "mental_health": null, "work_stress": "work as a software engineer with long hours", "environmental_exposure": null, "housing": "well-maintained apartment", "clean_water": "access to clean water", "occupation": "software engineer", "symptom_duration_map": "migraines for a few years, worsened in last six months", "symptom_intensity_map": "migraines often intense, interfering with daily activities"}, "label_leaf_id": "headache_migraine", "risk": 0.5, "uid": "f0a6856e"}
{"text": "Hello, my name is Ananya Ramesh. For the past few weeks, I've been experiencing recurring headaches that seem to intensify particularly on my left side, accompanied by sensitivity to light and noise. It's quite distressing as the pain is throbbing and can sometimes last for hours. I am a 28-year-old woman living in Bengaluru, Karnataka, and I work as a software engineer. Stress at work tends to escalate my condition, especially when dealing with tight deadlines. I usually try to avoid staying late, but sometimes it is unavoidable. Over the years, my migraines have worsened, though they initially began as mild headaches during my college years. My mother also suffered from migraines, so there seems to be a genetic component. I maintain a vegetarian diet predominantly consisting of rice, dals, and vegetables, and I stay away from caffeine as it seems to trigger my headaches. I try to stay physically active with regular yoga sessions, but these recent headaches have made it difficult to keep up with my routine. Sleep has been irregular as well, often less than six hours lately, which I suspect might be contributing to the frequency of these episodes. I don't consume alcohol or tobacco and have no known allergies. Fortunately, I have access to clean water and live in a comfortable apartment. My housing is stable, and I do not face any significant environmental exposures. As for my medical history, I haven't had any major surgeries or hospitalisations. I was immunized as a child but haven’t kept up with adult vaccinations. Currently, I am not on any regular medication but usually take over-the-counter pain relief when an attack occurs. I am concerned about these symptoms developing into something more serious if not managed properly.", "extracted": {"age": 28, "sex": "female", "ethnicity": null, "socioeconomic_status": null, "location": "Bengaluru, Karnataka", "region": "South India", "past_conditions": ["mild headaches"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": ["migraine"], "medication_history": ["over-the-counter pain relief"], "immunisation_status": "childhood immunisations only", "allergies": null, "family_history": ["mother suffered from migraines"], "diet": "vegetarian", "physical_activity": "regular yoga", "sleep_pattern": "irregular, less than six hours", "alcohol": "none", "tobacco": "none", "mental_health": null, "work_stress": "high", "environmental_exposure": null, "housing": "comfortable apartment", "clean_water": true, "occupation": "software engineer", "symptom_duration_map": {"headaches": "few weeks"}, "symptom_intensity_map": {"headaches": "intense, throbbing, left side"}}, "label_leaf_id": "headache_migraine", "risk": 0.5, "uid": "834773f7"}
{"text": "Hello, my name is Priya Sharma, and I am a 32-year-old woman living in Mumbai, India. Over the past few months, I've been experiencing recurring migraine headaches that have been quite debilitating. These episodes typically occur two to three times a month and last for a few hours, often making it difficult for me to perform daily tasks. I've noticed that the headaches are often accompanied by nausea and an increased sensitivity to light and sound. The pain usually starts on one side of my head and feels like a throbbing or pulsing sensation. I work as a software engineer, and I often find the stress of meeting tight deadlines to be overwhelming, which seems to trigger these migraines.\n\nMy diet mainly consists of traditional Indian meals, with a balance of vegetables, grains, and occasionally meat. I try to stay physically active by going for walks in the park nearby, but my routine is inconsistent, especially during periods of heavy workload. I usually get about 6 to 7 hours of sleep, although my sleep pattern can be disturbed during work-heavy periods. I don't consume alcohol or smoke tobacco.\n\nIn terms of medical history, I have had thyroid issues in the past, but they're currently under control with medication. I've never had any surgeries or serious hospitalizations. I believe my immunizations are up to date, though I haven't checked my records recently. My family does have a history of migraines, as both my mother and sister experience similar symptoms. I'm concerned about the impact these migraines have on my productivity and quality of life, and I'm seeking advice on how to manage or reduce their frequency and intensity.", "extracted": {"age": 32, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": null, "location": "Mumbai", "region": "Maharashtra", "past_conditions": "thyroid issues", "surgeries": null, "hospitalisations": null, "chronic_illnesses": "thyroid issues", "medication_history": "thyroid medication", "immunisation_status": null, "allergies": null, "family_history": "migraines", "diet": "traditional Indian meals", "physical_activity": "inconsistent", "sleep_pattern": "6 to 7 hours, disturbed during heavy work periods", "alcohol": "none", "tobacco": "none", "mental_health": null, "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "software engineer", "symptom_duration_map": {"migraine": "a few hours", "nausea": "during migraine episodes"}, "symptom_intensity_map": {"migraine": "quite debilitating", "nausea": "accompanies migraines"}}, "label_leaf_id": "headache_migraine", "risk": 0.5, "uid": "2d3cbb19"}
{"text": "Hello, I am Rajesh, a 35-year-old living in Bengaluru, Karnataka. I work as a software engineer, which involves long hours sitting in front of a computer, and I've been experiencing tension headaches for the last two weeks. These headaches usually start in the afternoon and tend to intensify as the day goes on. They feel like a band tightening around my head, with pain mostly concentrated in the forehead and temples. I haven't had any major surgeries or hospitalizations in the past, but I do suffer from occasional insomnia due to work stress. Family history shows no indication of similar issues, though my father has hypertension. I tend to eat a balanced Indian diet but often skip meals due to work deadlines. My physical activity is limited to occasional weekends when I play badminton with friends. I try to manage my stress by meditating when I can find the time. I do not smoke or consume alcohol. Besides the headaches, I've been dealing with some neck stiffness, likely from poor posture at work. I drink plenty of water and have access to clean water at home, where I live in a comfortable apartment. I am vaccinated as per my age requirements and have no known allergies. Although the intensity of the headaches varies, they have been quite manageable with over-the-counter pain relievers and taking short breaks during work.", "extracted": {"age": 35, "sex": "male", "ethnicity": null, "socioeconomic_status": "middle", "location": "Bengaluru", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "occasional over-the-counter pain relievers", "immunisation_status": "up-to-date", "allergies": null, "family_history": "hypertension in father", "diet": "balanced Indian diet", "physical_activity": "limited to weekends", "sleep_pattern": "occasional insomnia", "alcohol": "non-drinker", "tobacco": "non-smoker", "mental_health": "stress from work", "work_stress": "high", "environmental_exposure": null, "housing": "comfortable apartment", "clean_water": "yes", "occupation": "software engineer", "symptom_duration_map": {"tension headache": "2 weeks"}, "symptom_intensity_map": {"tension headache": "moderate"}}, "label_leaf_id": "headache_tension", "risk": 0.2, "uid": "8a4bec37"}
{"text": "Hello, I'm Aravind, a 32-year-old software engineer living in Bengaluru. Over the past few weeks, I've been struggling with persistent tension headaches. They usually start in the back of my head and seem to wrap around to the front, creating a sensation similar to having a tight band around my forehead. They're not incredibly painful, but they are quite bothersome and occur almost every day, especially towards late afternoons. I have a demanding job, always meeting deadlines, which can get quite stressful. My lifestyle doesn't include much physical activity, primarily due to my busy schedule. I try to balance my lack of exercise with a healthy diet, mostly consisting of homemade Indian meals with plenty of fruits and vegetables. However, I do have a tendency to sip on quite a bit of coffee throughout the day to combat fatigue. My sleep pattern is also irregular, typically clocking in around 5-6 hours a night, which I suspect may be contributing to my headaches. I don't smoke and rarely drink any alcohol. There's no significant family history of similar conditions or migraines. My work environment is mostly indoors, with long hours in front of a computer screen, which might also be straining my eyes and adding to the tension. I haven't been hospitalized or undergone any major surgeries in the past. The last time I had a medical check-up was over a year ago, and everything seemed fine then. I haven't been on any regular medication or treatment for this issue yet.", "extracted": {"age": 32, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Bengaluru", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": null, "diet": "homemade Indian meals with fruits and vegetables", "physical_activity": "low", "sleep_pattern": "irregular, 5-6 hours", "alcohol": "rarely", "tobacco": "no", "mental_health": null, "work_stress": "high", "environmental_exposure": "indoors with computer use", "housing": null, "clean_water": null, "occupation": "software engineer", "symptom_duration_map": {"headache": "few weeks"}, "symptom_intensity_map": {"headache": "mild"}}, "label_leaf_id": "headache_tension", "risk": 0.3, "uid": "e6ea1385"}
{"text": "I've been experiencing recurring headaches over the last couple of weeks, and I'm starting to believe they might be tension headaches. It's a dull pain, mostly around my temples and sometimes the back of my head. I'm 34 years old and work as a software engineer in Bengaluru. My job can be quite stressful, especially with the constant deadlines. I usually work long hours, sometimes late into the night, which affects my sleep pattern. I typically get about 5 to 6 hours of sleep, which I know isn't ideal. I don't exercise regularly, though I walk for about 30 minutes a day. My diet consists mostly of typical Indian meals like rice, dal, vegetables, and occasionally non-vegetarian items. I don't smoke, but I do drink socially, about once or twice a month. I've never been hospitalized, and the only surgery I had was for my tonsils when I was a child. My father has a history of hypertension, but otherwise, there's not much concerning family medical history. I haven't experienced any other symptoms like nausea or vision problems except mild sensitivity to light when the headache is severe. I haven't tried medication for this yet, but I sometimes use an over-the-counter pain reliever, which provides some relief. My living conditions are good, with access to clean water and proper housing. I would appreciate advice on managing these headaches better, especially since they're impacting my ability to focus at work.", "extracted": {"age": 34, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Bengaluru", "region": "Karnataka", "past_conditions": ["tonsillectomy"], "surgeries": ["tonsillectomy"], "hospitalisations": null, "chronic_illnesses": null, "medication_history": ["over-the-counter pain reliever"], "immunisation_status": null, "allergies": null, "family_history": ["hypertension"], "diet": "Indian meals with rice, dal, vegetables, and occasional non-vegetarian items", "physical_activity": "walks 30 minutes a day", "sleep_pattern": "5 to 6 hours per night", "alcohol": "socially, once or twice a month", "tobacco": "none", "mental_health": null, "work_stress": "high due to constant deadlines", "environmental_exposure": null, "housing": "proper housing", "clean_water": true, "occupation": "software engineer", "symptom_duration_map": {"headache": "2 weeks"}, "symptom_intensity_map": {"headache": "mild to moderate"}}, "label_leaf_id": "headache_tension", "risk": 0.3, "uid": "ac658d8a"}
{"text": "Hello, my name is Rakesh Sharma, and I am a 34-year-old male residing in Pune, Maharashtra. I've been experiencing persistent tension headaches over the past few weeks. The pain typically starts in the late afternoon and is concentrated around my forehead and temples. Although the intensity is moderate and manageable, it does interfere with my ability to concentrate at work. I work as a software developer, and my job requires me to sit in front of a computer for long hours. I have noticed that the headaches seem to worsen on days when I am particularly stressed or have skipped meals. My diet consists mainly of traditional Indian meals, but I do tend to grab fast food occasionally due to my hectic schedule. I am a non-smoker and consume alcohol occasionally, maybe once or twice a month. I try to stay active by cycling over the weekends, though I don’t have a regular exercise routine. I believe I sleep around 6-7 hours a night, though it doesn’t always feel restful. My father had a history of hypertension, but I haven’t been diagnosed with any chronic illnesses myself. I haven’t undergone any surgeries nor have I been hospitalized recently. I also don’t have any known allergies. While my family tends to be healthy, my younger sister suffers from migraines, but I haven’t experienced any symptoms resembling hers. I live in a rented apartment in a fairly well-developed area, and we have access to clean water. As for environmental exposure, my office is well-ventilated, but I occasionally work from home, which is a bit cramped. I haven’t had a full medical check-up in a while, so I thought consulting online might help me understand if there’s anything I need to be particularly concerned about.", "extracted": {"age": 34, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": "hypertension", "diet": "traditional Indian meals with occasional fast food", "physical_activity": "cycling on weekends", "sleep_pattern": "6-7 hours, not always restful", "alcohol": "occasional", "tobacco": "non-smoker", "mental_health": null, "work_stress": "high", "environmental_exposure": "well-ventilated office, cramped home", "housing": "rented apartment", "clean_water": "yes", "occupation": "software developer", "symptom_duration_map": "weeks", "symptom_intensity_map": "moderate"}, "label_leaf_id": "headache_tension", "risk": 0.3, "uid": "c84a2190"}
{"text": "I am Rajesh, a 35-year-old man residing in Bangalore, Karnataka. For the past few days, I've been experiencing discomfort and pain in my stomach. It started about four days ago, and the pain has been intermittent but quite bothersome, especially after meals. I've tried to manage it with home remedies like ginger tea and a simple diet, but the discomfort persists. I'm usually quite healthy, and I maintain a balanced diet comprising mainly of rice, vegetables, and lentils. My physical activity includes walking for about 30 minutes daily. I work as a software engineer, which can be quite stressful at times, leading to irregular meal timings. I'm married, and my family is supportive, but they are concerned about this recurring pain. I have no known allergies and usually enjoy good health. I've never had any serious medical conditions or surgeries previously, nor have I been hospitalized. My immunisation is up-to-date, as far as I know. I occasionally consume alcohol during social gatherings but do not use tobacco. Sleep comes easily to me, with 7-8 hours a night. I belong to the middle class and live in an apartment that has access to clean water and a good environment. My father had issues with acidity, which sometimes makes me wonder if it could be hereditary. However, my current condition seems distinct, mainly presenting as a stomach ache without other symptoms like nausea or fever. This situation is new for me, and I'd like to find out the underlying cause.", "extracted": {"age": 35, "sex": "male", "ethnicity": null, "socioeconomic_status": "middle class", "location": "Bangalore", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up-to-date", "allergies": null, "family_history": "father had acidity issues", "diet": "balanced, rice, vegetables, lentils", "physical_activity": "30 minutes walking daily", "sleep_pattern": "7-8 hours per night", "alcohol": "occasional", "tobacco": "none", "mental_health": null, "work_stress": "can be stressful", "environmental_exposure": null, "housing": "apartment", "clean_water": true, "occupation": "software engineer", "symptom_duration_map": "4 days", "symptom_intensity_map": "intermittent, bothersome after meals"}, "label_leaf_id": "stomach_pain", "risk": 0.3, "uid": "1282997c"}
{"text": "Hello there, I am Ramesh, a 32-year-old male residing in Bengaluru, Karnataka. Over the last four days, I have been experiencing a dull ache in my abdomen, primarily around my lower stomach area. Initially, I dismissed it as just a result of something I ate, but with each passing day, the discomfort seems to persist. The pain doesn't seem to intensify with any particular activity, but it is consistent enough to cause concern. I've tried over-the-counter antacids, hoping it might just be acid reflux, but they haven't provided much relief. I haven't noticed any significant change in my diet recently. I generally eat a balanced diet with the usual South Indian staples like idli, dosa, rice, and sambar. I also include a good portion of vegetables in my meals. My lifestyle is moderately active; I try to walk at least 30 minutes every day and I work a desk job at an IT company. I don't smoke and I consume alcohol occasionally, primarily on weekends. I'm not aware of any allergies I might have. I recall having this kind of pain once before, about a year ago, but it disappeared after a couple of days. There hasn't been any major medical issue in the past, and I've never been hospitalized or undergone surgery. I tend to sleep about 6-7 hours a night, but lately, the discomfort has been affecting my sleep quality. My family has no significant history of chronic illnesses either. I drink filtered water that's safe and clean. Although this didn't seem like an emergency at first, it's beginning to interfere with my daily life. I hope to understand what might be causing this persistent stomach pain so I can address it effectively.", "extracted": {"age": 32, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Bengaluru", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter antacids", "immunisation_status": null, "allergies": null, "family_history": null, "diet": "balanced, includes South Indian staples and vegetables", "physical_activity": "moderate, walks 30 minutes daily", "sleep_pattern": "6-7 hours, affected by discomfort", "alcohol": "occasional consumption on weekends", "tobacco": "none", "mental_health": null, "work_stress": null, "environmental_exposure": null, "housing": null, "clean_water": "filtered, safe", "occupation": "desk job at IT company", "symptom_duration_map": {"stomach_pain": "4 days"}, "symptom_intensity_map": {"stomach_pain": "dull ache"}}, "label_leaf_id": "stomach_pain", "risk": 0.2, "uid": "59f2d6a9"}
{"text": "Hello Doctor, my name is Ananya and I have been experiencing stomach pain for the past few days. I am 28 years old and live in Bangalore, Karnataka. The pain started off mild but has been persistent, making me quite uncomfortable. I haven't felt any nausea or vomiting, and my appetite seems to be the same, though eating sometimes makes the pain a bit more noticeable. I've had no recent changes in my diet, which is mostly vegetarian and consists of typical South Indian foods like rice, sambar, and some vegetables. I drink plenty of clean water as well. There’s a history of digestive issues in my family, as my mother had similar problems, but I've never had any serious stomach-related issues in the past. I haven't undergone any surgeries nor have I been hospitalized before. I work in a corporate office, so my physical activity is limited to occasional weekend exercises and I generally sleep well for about 7 hours each night. I don't consume alcohol or tobacco. Stress at work comes and goes, but it hasn't been particularly high recently. I am concerned about this persistent pain and would appreciate your advice on how to proceed. I'm a bit worried but trying to manage without jumping to conclusions.", "extracted": {"age": 28, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": null, "location": "Bangalore", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": "digestive issues", "diet": "vegetarian", "physical_activity": "occasional exercise", "sleep_pattern": "7 hours", "alcohol": "none", "tobacco": "none", "mental_health": null, "work_stress": "moderate", "environmental_exposure": null, "housing": null, "clean_water": "yes", "occupation": "corporate worker", "symptom_duration_map": {"stomach_pain": "few days"}, "symptom_intensity_map": {"stomach_pain": "persistent"}}, "label_leaf_id": "stomach_pain", "risk": 0.3, "uid": "e95839ea"}
{"text": "Hello, my name is Ramesh, and I am a 45-year-old male residing in Pune, Maharashtra. I have been experiencing stomach pain for the past few days, and it doesn't seem to improve. The pain is usually in the middle of my abdomen, and it feels like a dull ache rather than sharp pains. It's constant throughout the day but seems to get worse after I eat my usual meals, which mainly consist of rice, lentils, and vegetables. I have tried avoiding spicy food, thinking it might help, but there has not been much difference. I work as a software engineer, which means I spend most of my time sitting at a desk. I try to get some physical activity by going for walks in the evening. My diet is mostly vegetarian, and I try to include a lot of fiber. I don't have any known allergies or chronic illnesses that I'm aware of. My sleep pattern is fairly regular, averaging about 7 hours of sleep per night. I don't drink alcohol or use tobacco at all. As far as I know, there is no family history of significant stomach issues. The pain started around a week ago, and I have not noticed any other symptoms like fever, vomiting, or diarrhea. My socioeconomic status is middle class, and I have access to clean water. Our housing is in a reasonably good neighborhood. I haven't had any significant hospitalizations or surgeries in the past, but I do remember having an episode of similar stomach pain a couple of years ago, which subsided on its own. I hope this current situation doesn't turn out to be serious.", "extracted": {"age": 45, "sex": "male", "ethnicity": null, "socioeconomic_status": "middle class", "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": "No significant stomach issues", "diet": "mostly vegetarian; rice, lentils, vegetables", "physical_activity": "evening walks", "sleep_pattern": "7 hours per night", "alcohol": "none", "tobacco": "none", "mental_health": null, "work_stress": null, "environmental_exposure": null, "housing": "good neighborhood", "clean_water": true, "occupation": "software engineer", "symptom_duration_map": {"stomach_pain": "1 week"}, "symptom_intensity_map": {"stomach_pain": "mild to moderate"}}, "label_leaf_id": "stomach_pain", "risk": 0.3, "uid": "6e24fcc3"}
{"text": "Hello, my name is Rajesh, a 34-year-old man residing in Jaipur, Rajasthan. Over the past week, I've been experiencing discomfort in my upper abdomen, just a little below my ribcage. The pain comes and goes, sometimes after I eat a spicy meal, which is quite common in our local Rajasthani cuisine. I don't recall having such pain before, and it's been quite puzzling. Although it's not excruciating, it's been persistent enough to cause me to alter my food choices. I did have a minor surgery to remove my appendix a few years ago, but I've fully recovered from that. I haven't had any hospitalizations apart from that instance. Generally, I lead a healthy lifestyle, practicing yoga three times a week, which helps keep me physically active. I maintain an average Indian diet, primarily vegetarian, with the occasional cheat day, indulging in sweets and spicy food. I sleep around 7 hours every night, which I believe is sufficient. I do not smoke, drink alcohol only socially, and have no known allergies. My family history includes diabetes on my father's side, but I've not shown any signs myself. My job as an IT consultant does bring occasional stress, but nothing beyond the usual, and I have no significant mental health issues. We live in a decent apartment with access to clean water, which we ensure is filtered. I’m beginning to wonder if my recent dietary indiscretions combined with stress at work could be contributing to this discomfort.", "extracted": {"age": 34, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Jaipur", "region": "Rajasthan", "past_conditions": null, "surgeries": "appendix removal", "hospitalisations": "appendix surgery", "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": "diabetes", "diet": "primarily vegetarian", "physical_activity": "yoga three times a week", "sleep_pattern": "7 hours per night", "alcohol": "socially", "tobacco": "non-smoker", "mental_health": null, "work_stress": "occasional IT consultant stress", "environmental_exposure": null, "housing": "decent apartment", "clean_water": "filtered access", "occupation": "IT consultant", "symptom_duration_map": "stomach pain duration: past week", "symptom_intensity_map": "stomach pain intensity: mild to moderate"}, "label_leaf_id": "stomach_pain_upper", "risk": 0.3, "uid": "ce3271d2"}
{"text": "Hi, I'm Ravi, a 35-year-old man living in Pune, Maharashtra. For the past three days, I've been experiencing a dull ache in my upper abdomen. It started quite suddenly and hasn't really improved. The pain isn't constant; it seems to come and go, but it's uncomfortable enough to disturb my daily activities. I haven't noticed any specific triggers, but it usually intensifies somewhat after meals. I'm worried because although it's not intense, it's persistent. I haven't had any nausea or vomiting, but I've been feeling very full even after eating only a small amount. My diet consists mostly of typical Indian meals, but I've been trying to cut down on spicy food recently, thinking it might help. For the past few years, I've had a sedentary lifestyle due to my desk job as a software engineer. I try to exercise occasionally but haven't been consistent. Stress at work is somewhat high as we're approaching a project deadline. I live in a middle-class neighborhood, and while my housing conditions are decent, I'm not very active. I generally sleep about 6 hours a night, which I know isn't ideal. I tend to consume alcohol socially about once a month and don't smoke. In terms of my medical history, I've had no major past conditions or surgeries. I had a hospital visit only once, two years ago, due to a minor workplace injury. As far as I know, I've no chronic illnesses, and I keep up-to-date with my immunizations. In my family, my father had a history of diabetes, but there's no history of gastrointestinal issues. I'm not aware of any allergies I might have. The availability of clean water in my area is satisfactory. I'm hoping to get advice on possible causes and whether I need to seek medical attention immediately.", "extracted": {"age": 35, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle-class", "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": 1, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up-to-date", "allergies": null, "family_history": "father had diabetes", "diet": "typical Indian meals, cutting down on spicy food", "physical_activity": "sedentary lifestyle, occasional exercise", "sleep_pattern": "6 hours per night", "alcohol": "socially, once a month", "tobacco": null, "mental_health": "work stress due to project deadline", "work_stress": "somewhat high", "environmental_exposure": null, "housing": "decent housing conditions", "clean_water": "satisfactory", "occupation": "software engineer", "symptom_duration_map": {"stomach_pain_upper": "3 days"}, "symptom_intensity_map": {"stomach_pain_upper": "mild to moderate"}}, "label_leaf_id": "stomach_pain_upper", "risk": 0.3, "uid": "603dd519"}
{"text": "Hello, my name is Arjun and I'm 34 years old. I reside in Mumbai, Maharashtra. I work as a software engineer and usually have a pretty hectic schedule. Lately, for the past three weeks, I've been experiencing consistent stomach pain, specifically in the upper abdomen area. Initially, I thought it might be something trivial, but the persistence of the discomfort has started to worry me. The pain isn't acute but comes as a dull ache that sometimes intensifies after eating. I haven't had any surgeries or major illnesses in the past, and my medical history is relatively clean, except for a bout of dengue fever a couple of years ago. I maintain a fairly healthy diet, primarily vegetarian, and practice yoga regularly to stay fit. Additionally, I try to sleep around 6-7 hours each night, though stress from work can interrupt this sometimes. I don't smoke, but I do enjoy the occasional drink on weekends. I haven't had any significant allergies, nor have I been hospitalized recently. My parents are generally healthy, though my father has diabetes. I live in a rented apartment in a mid-income neighborhood with good access to clean water and facilities. The environmental conditions here are mostly good, with minimal pollution. I have been trying to observe any changes in my condition, such as any potential triggers or food that might worsen the symptoms. So far, I haven't been able to pinpoint anything specific, which is frustrating. I'm hoping to get some advice on whether this is something that could resolve on its own or if I should seek further medical investigation.", "extracted": {"age": 34, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle_class", "location": "Mumbai", "region": "Maharashtra", "past_conditions": "dengue fever", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": "father has diabetes", "diet": "vegetarian", "physical_activity": "regular yoga", "sleep_pattern": "6-7 hours with occasional disturbances", "alcohol": "occasional drinks on weekends", "tobacco": "non-smoker", "mental_health": null, "work_stress": "moderate", "environmental_exposure": "minimal pollution", "housing": "rented apartment", "clean_water": "good access", "occupation": "software engineer", "symptom_duration_map": "three weeks", "symptom_intensity_map": "dull ache that intensifies after eating"}, "label_leaf_id": "stomach_pain_upper", "risk": 0.4, "uid": "0727f28f"}
{"text": "Hello, my name is Priya Singh, and I'm a 38-year-old woman living in Bangalore, India. Over the past six weeks, I've been experiencing persistent upper abdominal pain. It tends to get worse after meals and sometimes wakes me at night. I've never had anything like this before, but it's becoming quite disruptive. I'm generally quite healthy, with no significant medical history, and I haven’t had any surgeries. I had chickenpox as a child but otherwise no notable past conditions or chronic illnesses. I haven't been hospitalised before. I take a multivitamin daily but no other medications. My immunisations are up to date. I don't have any allergies. My family has a history of diabetes, as my father was diagnosed with Type 2 diabetes in his fifties. I try to maintain a balanced diet, usually consisting of traditional Indian meals, and I’m vegetarian. I practice yoga regularly for physical activity and consider my fitness level to be average. I sleep around six to seven hours each night, but the pain has affected my sleep lately. I don't drink alcohol or smoke. Mentally, I feel stable, although this ongoing issue is causing me some stress, especially concerning work. I work as an IT consultant and sometimes the job can be demanding. In terms of living conditions, I have good housing and access to clean water. I am concerned that this pain is something more serious, given that it hasn't gone away.", "extracted": {"age": 38, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Bangalore", "region": "Karnataka", "past_conditions": ["chickenpox"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": ["multivitamin"], "immunisation_status": "up to date", "allergies": null, "family_history": ["Type 2 diabetes"], "diet": "vegetarian, traditional Indian meals", "physical_activity": "yoga", "sleep_pattern": "6-7 hours per night, disrupted by pain", "alcohol": "none", "tobacco": "none", "mental_health": "stable, some stress", "work_stress": "present, due to demanding job", "environmental_exposure": null, "housing": "good", "clean_water": "yes", "occupation": "IT consultant", "symptom_duration_map": {"upper abdominal pain": "6 weeks"}, "symptom_intensity_map": {"upper abdominal pain": "persistent, worsens after meals, disrupts sleep"}}, "label_leaf_id": "stomach_pain_upper_long", "risk": 0.75, "uid": "295f5cb7"}
{"text": "Hello doctor, my name is Suresh and I'm 45 years old. For the past three weeks, I've been experiencing persistent upper abdominal pain. Initially, I thought it might go away on its own, but the discomfort seems to be getting worse. It's a dull, aching pain that sometimes spreads to my back. I've tried to manage it with some over-the-counter antacids, thinking it might be acidity, but there's been little relief. I work as an accountant, and sitting for long hours seems to aggravate the pain. My diet is mostly vegetarian, considering my family's traditional preferences, but I do indulge in spicy food occasionally, given our love for flavorful meals here in Mumbai. I don't smoke or drink alcohol, and my lifestyle is relatively sedentary, although I do go for walks in the evenings. Sleeping has also been a bit challenging lately, mostly because the pain sometimes keeps me up at night. I have a history of gastritis diagnosed a few years back, and I'm worried this might be related. In terms of medication, apart from the antacids, I'm not on any regular prescriptions. I've been fully immunized as far as I know, and my family hasn't had a history of serious health conditions. My home environment is quite comfortable, and we have access to clean water and good sanitation. Please advise what steps I should take next.", "extracted": {"age": 45, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Mumbai", "region": "Maharashtra", "past_conditions": "gastritis", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "occasional use of antacids", "immunisation_status": "fully immunized", "allergies": null, "family_history": null, "diet": "mostly vegetarian with occasional spicy food", "physical_activity": "occasional evening walks", "sleep_pattern": "disturbed due to pain", "alcohol": "none", "tobacco": "none", "mental_health": null, "work_stress": "related to being an accountant", "environmental_exposure": null, "housing": "comfortable", "clean_water": "available", "occupation": "accountant", "symptom_duration_map": {"upper abdominal pain": "three weeks"}, "symptom_intensity_map": {"upper abdominal pain": "moderate to severe"}}, "label_leaf_id": "stomach_pain_upper_long", "risk": 0.7, "uid": "2f8fc209"}
{"text": "Hello, I'm Kavita Singh, a 35-year-old housewife living in Pune, Maharashtra. For the past three months, I've been experiencing persistent upper stomach pain that hasn't improved despite trying home remedies and a mild antacid my local pharmacist recommended. The pain is mostly a dull ache, but at times it becomes sharp and quite unbearable, particularly after meals or when I lie down. I've also noticed some episodes of bloating and occasional nausea. My diet is primarily vegetarian, comprising of roti, sabji, and dal, with occasional poultry dishes during family gatherings. I don't smoke or drink alcohol, and I try to maintain a healthy lifestyle. I practice yoga for about 30 minutes every day and generally feel good otherwise, except for this nagging pain. My family has a history of gastric issues—my mother had similar problems in her late thirties but managed without any major interventions. I haven't had any surgeries or significant hospitalizations in the past. I ensure my family and I drink treated water. Economically, my family is middle class, and we live comfortably in our own house in a safe neighborhood. My husband works in the IT sector, which can be quite stressful for him, but he manages to balance work and family life well. As for mental health, I feel generally positive, although the persistent pain has been worrying me lately. We have a clean living environment, and I ensure regular health check-ups for my children. I've also had all my necessary immunizations as recommended. The intensity of the stomach pain varies but is particularly strong during late evenings. I hope to get some clarity and relief soon.", "extracted": {"age": 35, "sex": "female", "ethnicity": null, "socioeconomic_status": "middle class", "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "mild antacid", "immunisation_status": "up-to-date", "allergies": null, "family_history": "gastric issues", "diet": "vegetarian", "physical_activity": "30 minutes of yoga daily", "sleep_pattern": null, "alcohol": "no", "tobacco": "no", "mental_health": "generally positive", "work_stress": null, "environmental_exposure": null, "housing": "own house in a safe neighborhood", "clean_water": "yes, treated water", "occupation": "housewife", "symptom_duration_map": {"stomach_pain": "3 months"}, "symptom_intensity_map": {"stomach_pain": "varies, strong in evenings"}}, "label_leaf_id": "stomach_pain_upper_long", "risk": 0.4, "uid": "4b08ad08"}
{"text": "Hello, I'm Rohan, a 34-year-old male living in Pune, Maharashtra. For the past few months, I have been experiencing persistent upper stomach pain. Initially, I thought it was due to irregular eating habits or stress from work at my marketing job. But the discomfort seems to be increasing, and now it's becoming quite bothersome daily. My meals are a mix of traditional Maharashtrian food, which includes curries and rice, and I try to include vegetables and fruits regularly. I remember getting a similar pain about a year ago, which went away with antacids, but this time it hasn't subsided. I generally lead a busy lifestyle, working long hours at the office, and sometimes skipping meals, which I suspect might be contributing to the problem. I haven't undergone any surgeries, but I had dengue about three years ago and was hospitalized then. I take occasional OTC medications for headaches, but I'm not on regular medication. My sleep pattern is irregular, largely due to work stress, and I manage to get around 5 to 6 hours of sleep on average. I don't smoke, and my alcohol consumption is limited to social gatherings. My family history doesn't show any major illnesses, though my father has hypertension. I have no known allergies and have received all the standard immunizations. Recently, I've been worried that this prolonged pain might be signaling a more serious underlying issue, and I'm planning to consult a specialist for further investigation.", "extracted": {"age": 34, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": "dengue", "surgeries": null, "hospitalisations": "dengue", "chronic_illnesses": null, "medication_history": "OTC for headaches", "immunisation_status": "all standard immunizations", "allergies": null, "family_history": "father with hypertension", "diet": "traditional Maharashtrian food, mix of curries, rice, vegetables, fruits", "physical_activity": null, "sleep_pattern": "irregular, 5 to 6 hours", "alcohol": "limited to social gatherings", "tobacco": null, "mental_health": null, "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "marketing job", "symptom_duration_map": "few months of upper stomach pain", "symptom_intensity_map": "increasing discomfort, daily bother"}, "label_leaf_id": "stomach_pain_upper_long", "risk": 0.6, "uid": "d430fe06"}
{"text": "Hello, my name is Ramesh Kumar, and I'm a 54-year-old man living in Pune, Maharashtra. I've been experiencing some concerning symptoms lately and wanted to get them checked out. Over the past week, I've noticed a recurring pain in my chest, which primarily occurs when I'm engaged in activities like brisk walking or climbing stairs. The pain generally subsides after I rest for a while. It feels like a tightness in my chest, and it is quite discomforting. I haven't had such episodes before and it's making me quite anxious. I try to maintain a balanced diet, mostly vegetarian, with occasional indulgences in sweets, given my love for traditional Maharashtrian desserts. I work as a project manager in a local IT company, which can be quite stressful at times, especially with the deadlines we have been facing. I typically spend 8-10 hours a day working and another hour commuting. I am a non-smoker and I drink alcohol socially, maybe once or twice a month. I engage in moderate physical activity during the weekends, such as walking in a nearby park. I ensure that I sleep for about 6-7 hours every night, although the quality of sleep can be affected by stress. I live in a comfortable apartment with my family; we have access to clean water and good sanitation. I don't have any known chronic illnesses and my last health checkup a year ago went fine without any notable issues. I have not been on any regular medication nor have I had any surgeries or hospitalizations. My family has a history of heart problems, which is a bit of a concern for me. I am fully vaccinated as per the Indian immunization schedule. I’m looking forward to getting guidance on how to manage or further investigate these symptoms as I am worried they might be signs of something more serious.", "extracted": {"age": 54, "sex": "male", "ethnicity": null, "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up to date", "allergies": null, "family_history": "heart problems", "diet": "mostly vegetarian", "physical_activity": "moderate", "sleep_pattern": "6-7 hours", "alcohol": "socially", "tobacco": "none", "mental_health": null, "work_stress": "high", "environmental_exposure": null, "housing": "comfortable apartment", "clean_water": true, "occupation": "project manager", "symptom_duration_map": {"chest_pain": "1 week"}, "symptom_intensity_map": {"chest_pain": "moderate"}}, "label_leaf_id": "chest_pain", "risk": 0.4, "uid": "463a1329"}
{"text": "Hi, my name is Ramesh, and I am a 52-year-old male living in Kolkata, West Bengal. I've been experiencing some discomfort and pain in my chest over the past few days. The pain comes and goes, and it seems to get a little worse when I am walking or doing some physical activity. It's not extremely severe, but it's concerning enough for me to reach out. I work as a manager in a textile company, and my job does involve quite a bit of stress. I have been trying to manage it, though. I live in a moderately crowded area of the city with my wife and two children. We have access to clean water and proper housing. My diet is mostly traditional Indian meals like dal, rice, and sabzi. I am not a smoker, but I do consume alcohol occasionally, mostly during social gatherings. In terms of my medical history, I've had high blood pressure for the last four years and have been on medication to manage it. I've never had any major surgeries, but I was hospitalized for high blood pressure complications once, two years ago. As for my family's medical history, my father had a history of heart disease. I try to go for a walk in the mornings, about three times a week, to maintain some level of physical activity. My sleep pattern is relatively normal, around six to seven hours a night. I am not aware of any allergies. I am up-to-date with my vaccinations. The chest pain started about five days ago and hasn't shown any signs of worsening severely, but it's still persistent. I would appreciate any advice or recommendations you might have.", "extracted": {"age": 52, "sex": "male", "ethnicity": null, "socioeconomic_status": "middle class", "location": "Kolkata", "region": "West Bengal", "past_conditions": ["high blood pressure"], "surgeries": [], "hospitalisations": ["high blood pressure complications"], "chronic_illnesses": ["high blood pressure"], "medication_history": ["blood pressure medication"], "immunisation_status": "up-to-date", "allergies": null, "family_history": ["heart disease"], "diet": "traditional Indian meals", "physical_activity": "walking three times a week", "sleep_pattern": "6-7 hours per night", "alcohol": "occasional consumption", "tobacco": "non-smoker", "mental_health": null, "work_stress": "moderate", "environmental_exposure": null, "housing": "proper", "clean_water": true, "occupation": "textile company manager", "symptom_duration_map": {"chest pain": "5 days"}, "symptom_intensity_map": {"chest pain": "moderate"}}, "label_leaf_id": "chest_pain", "risk": 0.4, "uid": "d88f2369"}
{"text": "Hello, I'm Rajesh, a 45-year-old resident of Pune. Over the past week, I've been experiencing a distinct pain in my chest. Initially, I thought it might be due to some muscle strain, but the discomfort hasn't subsided. I'm a software engineer by profession, which requires long hours in front of a screen, and I often feel quite stressed because of the workload. My diet mostly includes homemade meals like rice, dal, and vegetables, with occasional non-vegetarian dishes. I maintain moderate physical activity, going for walks in the park about three times a week. Although I don't smoke, I do have the occasional drink at social gatherings. I get around 6-7 hours of sleep each night, but I often wake up feeling fatigued. My family has a history of heart disease; both my father and uncle suffered from it. This makes me particularly concerned about my own health. In terms of previous medical conditions, I was diagnosed with hypertension a few years ago for which I take prescribed medication regularly. I have never had any surgeries or major hospitalizations. My allergies are minimal, with only a slight reaction to dust. Regarding immunization, I have received all the necessary vaccines as per the schedule. Recently, the air quality in Pune has been fluctuating, contributing to a sense of unease regarding environmental exposure. Luckily, I live in a decent apartment with access to clean water. Given this recurring chest pain, especially in light of my family history, I'm concerned that it could be more than just stress or diet-related issues.", "extracted": {"age": 45, "sex": "male", "ethnicity": null, "socioeconomic_status": "middle class", "location": "Pune", "region": "Maharashtra", "past_conditions": "hypertension", "surgeries": null, "hospitalisations": null, "chronic_illnesses": "hypertension", "medication_history": "hypertension medication", "immunisation_status": "up-to-date", "allergies": "slight reaction to dust", "family_history": "heart disease", "diet": "homemade meals, occasional non-vegetarian", "physical_activity": "moderate", "sleep_pattern": "6-7 hours, often fatigued", "alcohol": "occasional social drinking", "tobacco": "none", "mental_health": null, "work_stress": "high", "environmental_exposure": "fluctuating air quality", "housing": "decent apartment", "clean_water": "yes", "occupation": "software engineer", "symptom_duration_map": {"chest pain": "1 week"}, "symptom_intensity_map": {"chest pain": "moderate"}}, "label_leaf_id": "chest_pain", "risk": 0.5, "uid": "b45dd6ae"}
{"text": "My name is Arun and I'm a 45-year-old male living in Pune, Maharashtra. Recently, I've been experiencing chest pain that occurs intermittently, especially after physical exertion or when I walk up a flight of stairs. This chest pain started about two weeks ago and usually lasts for a few minutes before subsiding. Initially, I thought it might be due to gas or indigestion, but the frequency has increased, making me a bit concerned. I do smoke occasionally, around five cigarettes a week, and I consume alcohol socially, maybe once or twice a month. My diet primarily includes moderate amounts of fish and vegetables, with occasional meat dishes. I work as an IT professional, which sometimes includes long hours that could be stressful. I try to maintain a moderate level of physical activity, walking for about 30 minutes daily. My sleep pattern is generally regular, getting about 7 hours per night. As for my medical history, I had a minor surgery for an appendix removal about ten years ago, and I have been hospitalized for a day during the surgery. I have no known allergies or family history of serious illnesses. My socioeconomic status is middle class, and I have access to clean water and live in a decent housing arrangement. I have been immunized as per the standard schedule until now. The chest pain has no associated symptoms like nausea or dizziness, mainly just an intense pressure. I've not been diagnosed with any chronic illnesses. Given these circumstances, I'm considering seeing a doctor to have it evaluated, especially because it's becoming more frequent. I'm slightly worried that it might be indicative of a more serious underlying condition.", "extracted": {"age": 45, "sex": "male", "ethnicity": null, "socioeconomic_status": "middle class", "location": "Pune, Maharashtra", "region": "Western India", "past_conditions": null, "surgeries": "appendix removal", "hospitalisations": "1 day during appendix surgery", "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up to date", "allergies": null, "family_history": null, "diet": "moderate amounts of fish and vegetables, occasional meat dishes", "physical_activity": "30 minutes daily", "sleep_pattern": "7 hours per night", "alcohol": "socially, once or twice a month", "tobacco": "occasionally, five cigarettes a week", "mental_health": null, "work_stress": "long hours can be stressful", "environmental_exposure": null, "housing": "decent housing arrangement", "clean_water": true, "occupation": "IT professional", "symptom_duration_map": {"chest pain": "2 weeks"}, "symptom_intensity_map": {"chest pain": "intermittent, especially after exertion"}}, "label_leaf_id": "chest_pain", "risk": 0.6, "uid": "3a4dd6c7"}
{"text": "Hello, my name is Arvind Kumar, and I’m a 52-year-old man residing in Pune, Maharashtra. I've recently been experiencing chest pain, particularly when I engage in physical activities like climbing stairs or brisk walking. It's been going on for the past three weeks, and it's getting progressively more uncomfortable. The pain usually subsides a few minutes after I rest, but it's quite concerning. I have a family history of heart disease, as my father had similar issues. My lifestyle is moderately active as I work as an accountant and sometimes do field visits which require moving around the city. I don't consume alcohol, but I did smoke in my youth. I quit smoking twenty years ago. My diet consists mainly of home-cooked meals, including rice, vegetables, dal, and chapati. I try to avoid oily food, but I do have a sweet tooth. I’m not on any regular medication, but I was prescribed some for high cholesterol last year, which I was advised to manage with diet. I’ve had two hospitalisations in the past, both related to my appendix surgery ten years ago. I don’t have any known allergies, and my vaccinations are up to date. I typically sleep about 6-7 hours a night, although at times stress from work affects my sleep quality. The environmental conditions in my area are relatively clean, though air pollution can be an issue sometimes. My home has access to clean water and stable housing conditions. I sometimes feel the stress of balancing work and personal life, which may contribute to feeling fatigued occasionally.", "extracted": {"age": 52, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Pune, Maharashtra", "region": "urban", "past_conditions": ["high cholesterol"], "surgeries": ["appendix"], "hospitalisations": 2, "chronic_illnesses": null, "medication_history": ["cholesterol medication"], "immunisation_status": "up to date", "allergies": null, "family_history": ["heart disease"], "diet": "home-cooked meals with rice, vegetables, dal, chapati; avoids oily food", "physical_activity": "moderate, includes field visits and occasional exertion", "sleep_pattern": "6-7 hours, affected by work stress", "alcohol": "none", "tobacco": "quit smoking twenty years ago", "mental_health": null, "work_stress": "sometimes", "environmental_exposure": "air pollution occasionally", "housing": "stable", "clean_water": "yes", "occupation": "accountant", "symptom_duration_map": {"chest pain": "3 weeks"}, "symptom_intensity_map": {"chest pain": "increases with exertion"}}, "label_leaf_id": "chest_pain_exertion", "risk": 0.85, "uid": "a8ea8993"}
{"text": "My name is Rajesh Venkatesan, and I reside in the bustling city of Chennai, Tamil Nadu. Being a 52-year-old male, I work as a bank manager which often comes with its own stressors. Recently, I have been experiencing sharp chest pains, particularly noticeable when I exert myself physically, like during my routine morning walks or when climbing stairs. This started about two weeks ago and has gradually become more intense, which has been quite concerning. I haven't had any surgeries or hospitalizations recently, but I am on medication for hypertension, which I was diagnosed with about five years ago. My family has a history of heart-related issues, with both my father and grandfather suffering from heart conditions. Although I try to maintain a balanced diet with a mix of south Indian traditional meals and occasional indulgences, my physical activity is limited to the morning walk due to a packed schedule. I get about six hours of sleep on average, which might not be sufficient but is what I can manage. I don't consume alcohol, but I used to be a regular tobacco user until six months ago when I decided to quit. My mental health has generally been stable, notwithstanding the stress from work. I live in a comfortable apartment with access to clean water. I am concerned that these persistent pains might indicate something serious, given my family history and the symptoms occurring with physical exertion.", "extracted": {"age": 52, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Chennai", "region": "Tamil Nadu", "past_conditions": "hypertension", "surgeries": null, "hospitalisations": null, "chronic_illnesses": "hypertension", "medication_history": "medication for hypertension", "immunisation_status": null, "allergies": null, "family_history": "heart-related issues", "diet": "south Indian traditional meals", "physical_activity": "morning walks", "sleep_pattern": "six hours on average", "alcohol": "none", "tobacco": "used to be a regular user, quit six months ago", "mental_health": "stable", "work_stress": "stress from work", "environmental_exposure": null, "housing": "comfortable apartment", "clean_water": "access to clean water", "occupation": "bank manager", "symptom_duration_map": {"chest pain": "two weeks"}, "symptom_intensity_map": {"chest pain": "gradually more intense"}}, "label_leaf_id": "chest_pain_exertion", "risk": 0.8, "uid": "4fd8037a"}
{"text": "Hello, my name is Rajesh Kumar and I am a 48-year-old male living in Mumbai, India. I work as a manager in a large manufacturing company, and my job often involves a fair amount of stress and long hours. Lately, I've been experiencing chest pain, particularly when I'm engaged in physical activities such as climbing stairs or walking briskly to catch the local train. The pain subsides when I rest, but it's concerning me. I am generally healthy and try to maintain a balanced diet, but with my busy schedule, I often grab quick meals, which may not always be the healthiest options. I do not smoke, but I occasionally consume alcohol, typically a few drinks during social gatherings. My family history includes heart disease, as my father was diagnosed with it in his 50s. I try to exercise regularly, but it's mostly limited to weekends when I go for a jog in the park. I sleep around 6 hours each night, but the quality of my sleep varies, especially when I am stressed about work. My overall mental health is generally stable, though stress sometimes impacts my mood and sleep patterns. I live in a comfortable apartment with access to safe drinking water. I haven’t had any major surgeries or hospitalizations in the past. I’m up to date with my vaccinations and not aware of any significant allergies. This chest pain has only been happening for the past two weeks and is moderate in intensity. Given my family history, I’m worried it could be something serious, and I'm looking for advice on what could be causing this and what steps I should take next.", "extracted": {"age": 48, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Mumbai", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up to date", "allergies": null, "family_history": "heart disease", "diet": "balanced but with occasional unhealthy meals", "physical_activity": "weekend jogging", "sleep_pattern": "about 6 hours with variable quality", "alcohol": "occasional", "tobacco": null, "mental_health": "generally stable with stress impact", "work_stress": "high", "environmental_exposure": null, "housing": "comfortable apartment", "clean_water": true, "occupation": "manager in manufacturing", "symptom_duration_map": {"chest pain": "past two weeks"}, "symptom_intensity_map": {"chest pain": "moderate"}}, "label_leaf_id": "chest_pain_exertion", "risk": 0.8, "uid": "944f05fc"}
{"text": "Hello, I hope you can help me figure out what's happening. My name is Kavita, and I'm 29 years old, residing in Bangalore. Over the past week, I've noticed a peculiar rash appearing on my arms and legs. It's not particularly itchy, but it's been spreading slowly, and the red patches are somewhat alarming. I haven't changed any skincare products or detergents recently, nor have I eaten anything out of the ordinary. I work as a software engineer, so I spend most of my days indoors in an air-conditioned environment. My diet is quite balanced; I enjoy traditional South Indian foods, lots of vegetables, and I ensure to drink plenty of water throughout the day. I jog in the mornings for about 30 minutes to keep fit, but I haven't been able to do so recently due to the discomfort from the rash. I have no known allergies, and I'm generally healthy. The only medication I take regularly is a multivitamin, and my immunizations are up-to-date. My family doesn't have a history of skin conditions as far as I know. The rash hasn't been painful, which is a relief, but I'm concerned about its persistence. I have not had any recent illnesses or surgeries, and there's been no significant environmental exposure that I'm aware of, living in a clean and modern housing society with access to clean water. My mental health is generally stable, although there have been stressful periods at work, especially with recent project deadlines. I don't smoke or consume alcohol regularly. I would really appreciate any advice on how to address this condition and whether I need any specific tests or treatments.", "extracted": {"age": 29, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Bangalore", "region": "South India", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "multivitamin", "immunisation_status": "up-to-date", "allergies": null, "family_history": null, "diet": "traditional South Indian, balanced vegetables", "physical_activity": "jogging 30 minutes daily", "sleep_pattern": null, "alcohol": "does not consume regularly", "tobacco": "non-smoker", "mental_health": "stable, some work stress", "work_stress": "project deadlines", "environmental_exposure": null, "housing": "modern housing society", "clean_water": "access to clean water", "occupation": "software engineer", "symptom_duration_map": {"rash": "1 week"}, "symptom_intensity_map": {"rash": "mild"}}, "label_leaf_id": "skin_rash", "risk": 0.2, "uid": "e806b344"}
{"text": "Hi, I'm Rajesh, a 32-year-old IT professional from Chennai. For the past week, I've noticed a patchy rash on my forearms and neck. Initially, I thought it was due to the recent heatwave we've been experiencing or maybe some allergic reaction, as I sometimes have sensitive skin. However, it's been persistent and doesn't seem to be improving. I haven't changed any of my personal care products recently, and I don't recall coming into contact with any new substances that might cause this reaction. The rash is red and slightly raised, but it doesn't itch much. I've been under quite a bit of stress at work, with deadlines approaching, and my sleep hasn't been the best either. Usually, I try to eat balanced meals, mostly South Indian dishes like dosa and sambar, but the stress sometimes makes me skip meals. Physically, I try to stay active, going for a walk in the evenings. I don't smoke or drink alcohol, and I've never faced any serious health issues in the past, aside from the occasional common cold. My family's medical history doesn't indicate anything related to skin conditions. We've always had access to clean water at home. Given the current situation, I wonder if this could be due to stress or some environmental factor, and would like advice on how to best manage it.", "extracted": {"age": 32, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Chennai", "region": "Tamil Nadu", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": null, "diet": "balanced meals, South Indian dishes like dosa and sambar", "physical_activity": "goes for a walk in the evenings", "sleep_pattern": "poor, due to stress and deadlines", "alcohol": "does not drink", "tobacco": "does not smoke", "mental_health": "under stress at work", "work_stress": "high, with approaching deadlines", "environmental_exposure": "possible heatwave exposure", "housing": null, "clean_water": "access to clean water at home", "occupation": "IT professional", "symptom_duration_map": {"rash": "one week"}, "symptom_intensity_map": {"rash": "mild"}}, "label_leaf_id": "skin_rash", "risk": 0.2, "uid": "eaa150cd"}
{"text": "Hi, I'm Priya from Pune. I'm a 28-year-old woman working in a tech startup. A few weeks ago, I noticed some unusual redness on my arms and legs, which has gradually spread. The rash is not itchy, and there are no bumps, but the redness is quite noticeable and worrying me. I don't remember having a rash like this before, and I haven't switched my soap or laundry detergent recently. My diet mostly consists of rice, vegetables, and occasional non-vegetarian meals, as I come from a traditional Tamil family. I have a desk job, but I try to stay active by walking around my neighborhood park in the evenings. I live with my parents in a spacious flat in a residential neighborhood, and we have access to clean water. I have a history of mild seasonal allergies but nothing severe requiring medication. I'm generally healthy and keep up with regular vaccinations. There hasn't been any recent stress or significant changes in my life. I was wondering if you could provide some guidance or suggest if further investigation is needed.", "extracted": {"age": 28, "sex": "female", "ethnicity": "Tamil", "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": "mild seasonal allergies", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up-to-date", "allergies": "seasonal", "family_history": null, "diet": "rice, vegetables, occasional non-vegetarian meals", "physical_activity": "walking", "sleep_pattern": null, "alcohol": null, "tobacco": null, "mental_health": null, "work_stress": null, "environmental_exposure": null, "housing": "spacious flat", "clean_water": "available", "occupation": "tech startup", "symptom_duration_map": {"skin_rash": "a few weeks"}, "symptom_intensity_map": {"skin_rash": "mild"}}, "label_leaf_id": "skin_rash", "risk": 0.2, "uid": "582c03d1"}
{"text": "Hi there, I'm Rajesh, a 34-year-old male residing in Kolkata. Over the past few days, I've noticed a skin rash developing on my arms and legs. These small red bumps aren't particularly itchy or painful; in fact, they almost go unnoticed unless I look closely. They appeared about five days ago, initially on my arms, and gradually spread to my legs. I work as a school teacher, which means I'm usually indoors, but I do enjoy gardening during the weekends. I haven't switched any skincare products or detergents recently, so I'm not sure what's triggered this rash. I had the chickenpox when I was a child, but apart from that, I've been fairly healthy, with no prior major illnesses or hospitalizations. I don't take any medications regularly, and I'm not aware of any allergies, though dust and pollen sometimes make me sneeze a bit. My family doesn't have a history of skin-related conditions. My diet is pretty balanced, mainly vegetarian with plenty of fruits and vegetables, and I don't drink alcohol or smoke. I do make sure to drink filtered water at home. Sleep hasn't been much of an issue for me; I usually get about 7 hours per night. I would say my lifestyle isn't overly stressful, though there are the usual challenges. I wonder if the time I spent outdoors recently has exposed my skin to something unusual. I hope you can help me figure out what might be causing this rash.", "extracted": {"age": 34, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Kolkata", "region": "West Bengal", "past_conditions": ["chickenpox"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": ["dust", "pollen"], "family_history": null, "diet": "vegetarian with plenty of fruits and vegetables", "physical_activity": null, "sleep_pattern": "about 7 hours per night", "alcohol": "no", "tobacco": "no", "mental_health": null, "work_stress": "usual challenges", "environmental_exposure": null, "housing": null, "clean_water": "filtered", "occupation": "school teacher", "symptom_duration_map": {"rash": "5 days"}, "symptom_intensity_map": {"rash": "mild"}}, "label_leaf_id": "skin_rash", "risk": 0.2, "uid": "706b936d"}
{"text": "Hello Doctor, my name is Priya, and I've been experiencing a bothersome skin rash for the past week or so. It started as a few small red bumps on my forearms, but over the days, they have spread to my legs and back as well. The rash is incredibly itchy, especially at night, which has been affecting my sleep. I'm 27 years old, living in Bengaluru, Karnataka. I've tried some over-the-counter creams, but they haven't provided much relief. I wonder if my recent change in skincare products could be causing this. I work as a software engineer, and due to the nature of my job, I do spend a lot of time indoors under air conditioning. I haven't experienced any other symptoms like fever or difficulty breathing, thankfully. I live in a shared apartment, and we do ensure cleanliness and have access to clean water. My diet is mostly vegetarian, and I exercise fairly regularly, though the itching has made it harder to concentrate on my workouts lately. Aside from this, my health has been generally good, no significant past medical conditions or surgeries. My family doesn't have a history of similar skin issues. I hope you can guide me on a suitable treatment.", "extracted": {"age": 27, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Bengaluru", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": null, "diet": "vegetarian", "physical_activity": "regular", "sleep_pattern": "disrupted due to itching", "alcohol": null, "tobacco": null, "mental_health": null, "work_stress": null, "environmental_exposure": "air conditioning", "housing": "shared apartment", "clean_water": true, "occupation": "software engineer", "symptom_duration_map": {"itchy_skin_rash": "7-10 days"}, "symptom_intensity_map": {"itchy_skin_rash": "moderate"}}, "label_leaf_id": "skin_rash_itchy", "risk": 0.4, "uid": "ce003a38"}
{"text": "Hello, I'm Rajesh Kumar, a 32-year-old man living in Chennai. Over the past week, I've developed an itchy rash on my arms and neck. The rash started after I returned from a weekend hiking trip in the nearby hills. Initially, it was just a slight discoloration, but now it's become quite itchy, and it's been difficult for me to concentrate at work because of it. I work as a software engineer, and thankfully, I haven't missed work because of this issue, but it is quite bothersome. I haven't changed any skincare products recently, so I'm wondering if this could be an allergic reaction from something outdoors. I don't believe I have any known allergies, but my father had eczema in his early 40s. I am otherwise healthy with no chronic illnesses and have never been hospitalized. I maintain a balanced diet with a mix of vegetarian and non-vegetarian meals, mostly cooking Indian dishes. I also engage in moderate physical activity, jogging three times a week. I do not smoke or consume alcohol. My sleep pattern is generally regular, getting around 7-8 hours per night. We live in an apartment in a relatively clean area with access to clean water. I haven't had any notable environmental exposures recently unless there's something related to my time in the hills. I would appreciate some guidance on how to manage this itchy rash and if I should make any immediate changes to my routine.", "extracted": {"age": 32, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Chennai", "region": "Tamil Nadu", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": "father had eczema", "diet": "mixed vegetarian and non-vegetarian", "physical_activity": "jogging three times a week", "sleep_pattern": "7-8 hours per night", "alcohol": "no", "tobacco": "no", "mental_health": null, "work_stress": null, "environmental_exposure": "recent hiking trip", "housing": "apartment in a clean area", "clean_water": "yes", "occupation": "software engineer", "symptom_duration_map": {"itchy rash": "1 week"}, "symptom_intensity_map": {"itchy rash": "moderate"}}, "label_leaf_id": "skin_rash_itchy", "risk": 0.4, "uid": "8b006c96"}
{"text": "Hi, my name is Suresh Kumar, and I'm reaching out because I've been experiencing a persistent and itchy skin rash for the last couple of weeks. I'm a 34-year-old male residing in Bangalore. The rash started on my arms and has slowly spread to my chest and back. It is quite itchy and uncomfortable, particularly at night, which is disturbing my sleep. This has been going on for about 10 days now, and while I thought it might be an allergic reaction to something, over-the-counter antihistamines haven't provided much relief. I haven't had similar problems before, and I'm not on any medication other than the antihistamine I've been taking recently. My diet is predominantly South Indian, with a lot of home-cooked meals. I avoid alcohol and rarely consume tobacco. I work as a software engineer, and while I do experience occasional work stress, it's manageable. My family doesn't have any notable history of skin conditions, though my mother has asthma. I haven't undergone any surgeries or had significant hospitalizations. I'm generally in good health, having received all my necessary immunizations. In terms of environmental exposure, I recently started using a new laundry detergent; I wonder if that could be the cause. My housing situation is quite good with access to clean water. Given the current situation, I'm hoping to get some advice on the next steps to take for this rash.", "extracted": {"age": 34, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle-class", "location": "Bangalore", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "recent use of over-the-counter antihistamines", "immunisation_status": "up-to-date", "allergies": null, "family_history": "mother has asthma", "diet": "predominantly South Indian, home-cooked meals", "physical_activity": null, "sleep_pattern": "disturbed due to itching", "alcohol": "none", "tobacco": "rarely consume", "mental_health": null, "work_stress": "manageable", "environmental_exposure": "recent exposure to new laundry detergent", "housing": "good", "clean_water": "access to clean water", "occupation": "software engineer", "symptom_duration_map": {"skin rash": "10 days"}, "symptom_intensity_map": {"itchy": "high"}}, "label_leaf_id": "skin_rash_itchy", "risk": 0.4, "uid": "c649e882"}
{"text": "Hello, I'm Rajesh Kumar, a 35-year-old man living in Chennai, Tamil Nadu. I work as a software engineer in a mid-sized tech company. Over the past week, I've started noticing an itchy rash developing on my arms and neck. It initially began as small, red bumps but has since spread and become increasingly itchy, particularly at night. I've tried using a couple of over-the-counter antihistamines, but they haven't provided much relief. My diet consists mostly of traditional South Indian meals, with a fair share of rice, lentils, and vegetables, and I don't have any known food allergies. My family has a history of allergies, with my mother experiencing similar skin issues during certain seasons. I exercise regularly, going for a jog every morning, and I maintain a balanced routine despite the pressures of work. I don't drink alcohol or smoke. This rash is interfering with my sleep as the itching intensifies at night, making it difficult to rest properly. My living conditions are quite comfortable, with access to clean water and good housing. I haven't been exposed to new environmental factors or harsh chemicals that I can think of. Last year, I received regular vaccinations as advised. I am concerned about this rash as it seems to progressively worsen, and I would appreciate some advice or treatment options to manage this condition.", "extracted": {"age": 35, "sex": "male", "ethnicity": null, "socioeconomic_status": "middle class", "location": "Chennai", "region": "Tamil Nadu", "past_conditions": "allergies", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter antihistamines", "immunisation_status": "up-to-date", "allergies": null, "family_history": "allergies", "diet": "traditional South Indian", "physical_activity": "regular jogging", "sleep_pattern": "disturbed due to itching", "alcohol": "none", "tobacco": "none", "mental_health": null, "work_stress": "moderate", "environmental_exposure": null, "housing": "comfortable", "clean_water": "yes", "occupation": "software engineer", "symptom_duration_map": {"itchy rash": "1 week"}, "symptom_intensity_map": {"itchy rash": "increasing in intensity, particularly at night"}}, "label_leaf_id": "skin_rash_itchy", "risk": 0.4, "uid": "06f2e933"}
{"text": "Hi, I'm Ravi, a 34-year-old software engineer living in Bengaluru. Over the past few days, I've been experiencing bouts of nausea, which has been quite disruptive to my usual routine. It began about three days ago, and while initially, I thought it might be something I ate, the feeling hasn't subsided. I normally eat a balanced diet with plenty of fruits and vegetables, but last weekend I attended a wedding and sampled a variety of foods that were new to me. I don't drink alcohol, but I do consume a moderate amount of spicy and rich foods regularly. I get a good amount of physical activity, mainly through cycling to work and occasional yoga sessions. My sleep pattern is usually stable, with around 7 to 8 hours each night, though the nausea has made it challenging to fall asleep quickly. In terms of health history, I haven't had any major illnesses or surgeries, and I am up to date with all my vaccinations. I don't have any known allergies. In my family, there are no significant hereditary diseases. Work can be a bit stressful at times, especially with tight deadlines, but it's nothing I can't handle. My housing situation is good, and I have access to clean drinking water at home. I don’t smoke or use tobacco products. Overall, I’m slightly concerned this nausea could be something more than just a temporary issue, but I’m hoping it will pass soon.", "extracted": {"age": 34, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Bengaluru", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up to date", "allergies": null, "family_history": null, "diet": "balanced diet with fruits and vegetables, spicy and rich foods", "physical_activity": "cycling and yoga", "sleep_pattern": "7 to 8 hours, disrupted due to nausea", "alcohol": "does not consume", "tobacco": "non-user", "mental_health": null, "work_stress": "manageable stress due to deadlines", "environmental_exposure": null, "housing": "good", "clean_water": "access", "occupation": "software engineer", "symptom_duration_map": {"nausea": "3 days"}, "symptom_intensity_map": {"nausea": "disruptive but not severe"}}, "label_leaf_id": "nausea", "risk": 0.4, "uid": "c1afab5e"}
{"text": "Hello, I'm Rakesh, a 35-year-old male living in Pune, Maharashtra. I've been experiencing a constant feeling of nausea for the past few days. It's not unusual for me to feel like this occasionally after eating spicy food or when I'm really stressed at work. However, this time the sensation doesn't seem to go away regardless of what I eat, which is primarily a typical Indian diet consisting of rice, chapatis, vegetables, and sometimes chicken. I generally try to eat clean and stick to home-cooked meals, but over the past month, due to longer working hours at the IT company where I work as a project manager, I've been ordering food from outside more frequently. My socioeconomic status is middle class. I'm not sure if this nausea is related to my recent change in diet or possibly stress from work, as there have been some recent project deadlines. I have no known allergies and have never had major health issues. However, I occasionally suffer from acidity, especially when I skip meals or eat too late in the night. My father had a history of hypertension, but otherwise, my family history is not significant for any critical illnesses. I occasionally indulge in a glass of wine during social gatherings but do not use tobacco. I have a fairly active lifestyle, enjoying jogging in the mornings and playing cricket on weekends. My sleep pattern has been a bit erratic lately, averaging around 5-6 hours of sleep, possibly due to work stress. There's no significant environmental exposure that I'm aware of, and we ensure our drinking water is filtered. My housing conditions are quite good as I live in a well-maintained apartment complex in the city. I haven't been recently immunized but I did complete my primary vaccinations as a child. I visited the doctor last time a couple of years ago for a check-up, and I normally stay healthy. I sincerely hope this nausea is just a temporary issue and not something more serious.", "extracted": {"age": 35, "sex": "male", "ethnicity": null, "socioeconomic_status": "middle class", "location": "Pune", "region": "Maharashtra", "past_conditions": ["acidity"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "complete childhood vaccinations", "allergies": null, "family_history": ["hypertension"], "diet": "typical Indian diet (rice, chapatis, vegetables, chicken), recently more outside food", "physical_activity": "jogging, playing cricket", "sleep_pattern": "erratic, 5-6 hours", "alcohol": "occasional", "tobacco": "none", "mental_health": "no significant issues mentioned", "work_stress": "recent project deadlines causing stress", "environmental_exposure": null, "housing": "well-maintained apartment", "clean_water": "filtered", "occupation": "project manager in IT company", "symptom_duration_map": {"nausea": "few days"}, "symptom_intensity_map": {"nausea": "mild"}}, "label_leaf_id": "nausea", "risk": 0.4, "uid": "7d8035b8"}
{"text": "Hello doctor, my name is Arunesh Kumar, and I reside in Ahmedabad, Gujarat. I am 33 years old, and I wanted to discuss a health issue that I've been experiencing. For the past three days, I have been feeling quite nauseated. It started off mild initially, but it worsened a little yesterday. It feels like there's a persistent queasiness in my stomach, and sometimes I even feel like I'm on the verge of vomiting, although I haven't actually vomited yet. This has made it difficult for me to eat my usual meals, which are typically a mix of roti, sabzi, and lentils, as well as occasional meat dishes. I haven't noticed any other symptoms like fever or pain, but the nausea is quite uncomfortable. I've had a few episodes of nausea in the past, usually associated with motion sickness, but this time it's been different since it's persistent even when I'm at home. My sleeping pattern is normal — I get about 7 hours of sleep each night, and I live in a clean, well-ventilated house. There aren't any significant stressors at work. I work as a software engineer, hence my physical activity is limited mostly to evening walks in the park. I do not drink alcohol or smoke, and I have never been hospitalized or undergone any surgeries. My family has a history of diabetes on my mother's side, but no other significant health issues. I have no allergies that I know of, and my vaccinations are up to date. Lately, I've been a bit worried as the nausea affects my appetite and daily productivity.", "extracted": {"age": 33, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Ahmedabad", "region": "Gujarat", "past_conditions": ["motion sickness"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up to date", "allergies": null, "family_history": ["diabetes"], "diet": "roti, sabzi, lentils, occasional meat", "physical_activity": "evening walks", "sleep_pattern": "normal, 7 hours per night", "alcohol": "none", "tobacco": "none", "mental_health": null, "work_stress": null, "environmental_exposure": null, "housing": "clean, well-ventilated", "clean_water": null, "occupation": "software engineer", "symptom_duration_map": {"nausea": "3 days"}, "symptom_intensity_map": {"nausea": "mild to moderate"}}, "label_leaf_id": "nausea", "risk": 0.3, "uid": "78441509"}
{"text": "Hello, I'm Akshay, a 32-year-old male living in Jaipur, Rajasthan. I've been experiencing persistent nausea for the past week, and now I'm starting to feel incredibly dehydrated. I've not been able to keep down fluids, which has been really concerning for me. It's been progressively getting worse and is now affecting my daily activities. I work as a financial analyst, which already comes with its fair share of stress, and this condition is making it almost impossible to focus. I lead a relatively sedentary lifestyle with little physical activity, and my diet primarily consists of traditional Indian meals with a balance of carbs and proteins. I don't have any known allergies, and my previous medical history is relatively clear with no significant past conditions or surgeries. However, I was hospitalized once three years ago due to a severe case of food poisoning. My family has a history of diabetes on my father's side which has made me cautious about my health. I do consume alcohol occasionally, but I don't smoke. My sleep pattern has been irregular lately, possibly due to the discomfort from nausea. Fortunately, I have access to good housing and clean water. I'm growing increasingly worried about this situation, and my work stress has been exacerbated by these health issues.", "extracted": {"age": 32, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Jaipur", "region": "Rajasthan", "past_conditions": "food poisoning", "surgeries": null, "hospitalisations": "once, due to food poisoning three years ago", "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": "diabetes on father's side", "diet": "traditional Indian meals with a balance of carbs and proteins", "physical_activity": "sedentary", "sleep_pattern": "irregular", "alcohol": "occasional consumption", "tobacco": "none", "mental_health": null, "work_stress": "high", "environmental_exposure": null, "housing": "good", "clean_water": "access available", "occupation": "financial analyst", "symptom_duration_map": {"nausea": "1 week", "dehydration": "recently worsening"}, "symptom_intensity_map": {"nausea": "progressively worse", "dehydration": "increasingly severe"}}, "label_leaf_id": "nausea_dehydration", "risk": 0.8, "uid": "80a4960c"}
{"text": "Hi, I'm Ramesh, a 32-year-old male residing in Pune, Maharashtra. Recently, I've been experiencing persistent nausea and an alarming level of dehydration. It all started about a week ago, and I've noticed that it's been getting progressively worse. The thirst constantly bothers me, and no matter how much water I drink, I still feel parched. Along with the nausea, it's becoming difficult for me to keep anything down, be it a simple roti or a full meal. I've not had any serious medical history apart from a few common childhood illnesses like chickenpox. My diet usually includes a balanced mix of vegetables, rice, and occasional chicken, though I've been unable to maintain this due to the discomfort. I work at a call center, which sometimes gets stressful, but I've never had issues with my health linked to my job before. I usually sleep around 6-7 hours daily, though recently, sleep has been disrupted due to frequent trips to the bathroom. My family has no significant medical issues; my parents are generally healthy. We live in a modest apartment complex where water is normally clean, but I've been using filtered options. I don't consume alcohol or tobacco products, and I try to stay active with occasional walks. I'm getting increasingly worried as the symptoms are not subsiding, making it quite uncomfortable to go about daily activities.", "extracted": {"age": 32, "sex": "male", "ethnicity": null, "socioeconomic_status": "middle class", "location": "Pune", "region": "Maharashtra", "past_conditions": ["chickenpox"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": null, "diet": "balanced mix of vegetables, rice, and chicken", "physical_activity": "occasional walks", "sleep_pattern": "6-7 hours, disrupted lately", "alcohol": null, "tobacco": null, "mental_health": null, "work_stress": "sometimes stressful", "environmental_exposure": null, "housing": "modest apartment complex", "clean_water": true, "occupation": "call center representative", "symptom_duration_map": {"nausea": "1 week", "dehydration": "1 week"}, "symptom_intensity_map": {"nausea": "increasing", "dehydration": "increasing"}}, "label_leaf_id": "nausea_dehydration", "risk": 0.85, "uid": "f92c42a5"}
{"text": "Hello, my name is Ramesh Kumar, and I'm 34 years old. I live in Pune, Maharashtra, and work as a software engineer for a multinational company. Over the last few days, I've been experiencing constant nausea, which has progressively worsened. Initially, I thought it might have been some bad food, but now I'm feeling extremely dehydrated, despite drinking what I believe to be ample amounts of water. My diet is usually balanced, thanks to our traditional Indian meals, which include chapati, rice, dal, and vegetables. I refrain from consuming alcohol and tobacco products. During this period, I've found it hard to engage in my daily jog around the neighborhood or even focus adequately on my work due to the nausea. It’s been difficult for me to sleep peacefully as well, and I often wake up feeling even more nauseous and parched. Historically, I've been in good health with no major surgeries or hospitalizations, although last year I did have a bout of viral fever. My family has no significant history of diseases apart from some diabetes and hypertension in my parents. I keep myself vaccinated as per the schedule. Living in a fairly clean apartment with access to potable water has always been a priority for me. The recent rise in stress from work deadlines could be playing a part, as well as the occasional dust I encounter during my daily commute. I’m quite concerned that this nausea and feeling of dehydration might be affecting my overall health, and I would appreciate any guidance on managing these symptoms.", "extracted": {"age": 34, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Pune", "region": "Maharashtra", "past_conditions": ["viral fever"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up to date", "allergies": null, "family_history": ["diabetes", "hypertension"], "diet": "balanced traditional Indian meals", "physical_activity": "daily jog", "sleep_pattern": "disturbed", "alcohol": "no", "tobacco": "no", "mental_health": null, "work_stress": "high", "environmental_exposure": "dust", "housing": "clean apartment", "clean_water": "yes", "occupation": "software engineer", "symptom_duration_map": {"nausea": "few days", "dehydration": "few days"}, "symptom_intensity_map": {"nausea": "progressively worsening", "dehydration": "severe"}}, "label_leaf_id": "nausea_dehydration", "risk": 0.75, "uid": "2d89f46f"}
